{"<pad>": 0, "<sos>": 1, "<eos>": 2, "<unk>": 3, "in": 4, "the": 5, "function": 6, "gcd(a,b=integers)": 7, "if": 8, "b=1": 9, "return": 10, "a,": 11, "else": 12, "call": 13, "gcd(b,": 14, "a%b)": 15, "n": 16, ",": 17, "nn,": 18, "ans": 19, "=": 20, "integers": 21, "with": 22, "=0": 23, "Read": 24, "for": 25, "i=2": 26, "to": 27, "n-1": 28, "execute": 29, "set": 30, "nn": 31, "while": 32, "is": 33, "not": 34, "equal": 35, "0,": 36, "+": 37, "nn%i,": 38, "and": 39, "also": 40, "nn=": 41, "nn/i": 42, "o": 43, "gcd(ans,": 44, "n-2)": 45, "print": 46, "out": 47, "ans/o": 48, "\"/\"": 49, "(n-2)/o": 50, "gcd": 51, "integer": 52, "arguments": 53, "a": 54, "b": 55, "!b": 56, "?": 57, ":": 58, "%": 59, "b)": 60, "n,": 61, "0": 62, "read": 63, "i": 64, "2": 65, "-": 66, "1": 67, "inclusive": 68, "increment": 69, "by": 70, "(nn": 71, "i)": 72, "/": 73, "i;": 74, "of": 75, "o,": 76, "\"/\",": 77, "(n": 78, "2)": 79, "\"\\n\"": 80, "let": 81, "be": 82, "strings": 83, "st": 84, "exclusive": 85, "insert": 86, "\"": 87, "into": 88, "size": 89, "new": 90, "line": 91, "declare": 92, "m,": 93, "su": 94, "su2": 95, "c": 96, "m": 97, "greater": 98, "than": 99, "increase": 100, "value": 101, "decrease": 102, "remainder": 103, "division": 104, "b,": 105, "gcd1": 106, "as": 107, "arguments,": 108, "returning": 109, "from": 110, "result": 111, "run": 112, "modx": 113, "long": 114, "base,": 115, "ex": 116, "create": 117, "longs": 118, "ans,": 119, "val": 120, "1LL,": 121, "base": 122, "0LL": 123, "bitwise": 124, "(ans": 125, "*": 126, "val)": 127, "1000000009LL": 128, "(val": 129, ")": 130, "bitshift": 131, "right": 132, "1LL": 133, "ans1,": 134, "ans2": 135, "ans1": 136, "ans2=": 137, "constant": 138, "maxn": 139, "105": 140, "boolean": 141, "array": 142, "visit": 143, "vector": 144, "adj": 145, "2d": 146, "dist": 147, "v": 148, "dfs": 149, "start": 150, "argument,": 151, "void": 152, "visit[start]": 153, "true": 154, "add": 155, "element": 156, "end": 157, "adj[start]": 158, "pt": 159, "adj[start][i]": 160, "visit[pt]": 161, "false,": 162, "argument": 163, "adj[a]": 164, "adj[b]": 165, "dist[b][a]": 166, "exclusive,": 167, "dist[v[i]][v[(i": 168, "1)": 169, "n]]": 170, "inclusive,": 171, "decrementing": 172, "dist[v[i]][v[size": 173, "1]]": 174, "dist[v[i]][v[i": 175, "minimum": 176, "newline": 177, "map": 178, "string": 179, "iterator": 180, "it": 181, "character": 182, "sting": 183, "str": 184, "cin": 185, "m[str]": 186, "beginning": 187, "incrementing": 188, "it,": 189, "i,": 190, "k,": 191, "rem,": 192, "sum,": 193, "l": 194, "are": 195, "sum": 196, "k": 197, "rem": 198, "divide": 199, "__gcd": 200, "l,": 201, "(n-2)/l": 202, "s": 203, "s1": 204, "se": 205, "unique": 206, "j": 207, "s1,": 208, "appen": 209, "whitespace": 210, "length": 211, "s,": 212, "j,": 213, "'": 214, "',": 215, "su,": 216, "su2,": 217, "s2": 218, "arrays": 219, "110": 220, "integers,": 221, "book": 222, "values": 223, "less": 224, "ok": 225, "go": 226, "next": 227, "iteration": 228, "elements": 229, "at": 230, "an": 231, "exit": 232, "loop": 233, "s1[i]": 234, "s2[i]": 235, "continue": 236, "s1[j]": 237, "s2[j]": 238, "book[j]": 239, "stop": 240, "book[i]": 241, "num": 242, "vis": 243, "variable": 244, "counts": 245, "en": 246, "vis[1]": 247, "1,": 248, "vis[k]": 249, "vis[i]": 250, "num[k][i]": 251, "-1": 252, "num[i][k]": 253, "!=": 254, "invoke": 255, "called": 256, "x,": 257, "y": 258, "can": 259, "input": 260, "memset": 261, "num,": 262, "sizeof(num)": 263, "vis,": 264, "sizeof(vis)": 265, "num[x][y]": 266, "num[en][1]": 267, "-1,": 268, "num[1][en]": 269, "min": 270, "counts,": 271, "ne": 272, "y,": 273, "bytes": 274, "x": 275, "that": 276, "returns": 277, "assign": 278, "t": 279, "ct,": 280, "aa": 281, "g": 282, "ct": 283, "aa,": 284, "fastIo": 285, "char": 286, "MAT": 287, "MAT[i][j]": 288, "LC,": 289, "RC,": 290, "TR": 291, "BR": 292, "LC": 293, "RC": 294, "first": 295, "false": 296, "'*'": 297, "max": 298, "'\\n'": 299, "c,": 300, "p1": 301, "p2": 302, "fa": 303, "102": 304, "ints": 305, "viy": 306, "booleans": 307, "f1": 308, "dg": 309, "msh": 310, "viy[dg][0]": 311, "true,": 312, "v[dg][0]": 313, "fa[v[dg][0]][dg]": 314, "fa[v[dg][1]][dg]": 315, "v[dg][1]": 316, "define": 317, "f2": 318, "viy[dg][1]": 319, "push": 320, "v[a]": 321, "v[b]": 322, "fa[b][a]": 323, "set1": 324, "set2": 325, "map1": 326, "int": 327, "map2": 328, "cp": 329, "101": 330, "mc1": 331, "mc2": 332, "malloc_1": 333, "type": 334, "set1.count(a)": 335, "map1[a]": 336, "one": 337, "malloc_2": 338, "accepts": 339, "count": 340, "map2[a]": 341, "cnt": 342, "empty": 343, "clear": 344, "cp,": 345, "0,and": 346, "d": 347, "malloc_1(a)": 348, "malloc_2(b)": 349, "cp[c][d]": 350, "incremented": 351, "remove": 352, "all": 353, "lcm": 354, "tem": 355, "a%b": 356, "re": 357, "sum/re": 358, "(": 359, "p": 360, "decrement": 361, "store": 362, "p[s]": 363, "GCD": 364, "r": 365, "u": 366, "initialized": 367, "z": 368, "min_i,": 369, "min_j,": 370, "max_i,": 371, "max_j,": 372, "min_i": 373, "51,": 374, "min_j": 375, "51": 376, "55": 377, "a[i][j]": 378, "max_i": 379, "maximum": 380, "max_j": 381, "characters": 382, "100": 383, "G": 384, "G1": 385, "N": 386, "lsum,": 387, "ssum": 388, "cur,": 389, "G1[cur][i]": 390, "G[cur][i]": 391, "lsum": 392, "G[cur][1]": 393, "G[x][y]": 394, "G1[x][y]": 395, "G1[y][x]": 396, "cur": 397, "!vis[i]": 398, "G[cur][1],": 399, "G,": 400, "G1,": 401, "(maximum": 402, "y)": 403, "(((m": 404, "n)": 405, "(((n": 406, "m)": 407, "odd": 408, "even": 409, "(m": 410, "3": 411, "iterate": 412, "through": 413, "on": 414, "each": 415, "temp": 416, "n-2": 417, "edges": 418, "which": 419, "takes": 420, "pointer": 421, "visited,": 422, "index,": 423, "visited[index]": 424, "edges[index][i]": 425, ">=": 426, "visited[i]": 427, "*ans": 428, "dfs2": 429, "visited": 430, "edges[i][j]": 431, "edges[a][b]": 432, "edges[b][a]": 433, "&ans": 434, "edges[0][i]": 435, "edges[i][0]": 436, "break": 437, "&ans2": 438, "105,": 439, "or": 440, "address": 441, "ans2,": 442, "((l": 443, "x(0),": 444, "y(m": 445, "n(m),": 446, "z(0)": 447, "a[i]": 448, "b[i]": 449, "a[j]": 450, "b[j]": 451, "prev": 452, "mult": 453, "(prev-b)/d": 454, "(1": 455, "prev-b": 456, "0)": 457, "prev,": 458, "(prev": 459, "(((prev": 460, "d)": 461, "200": 462, "x1,": 463, "x2,": 464, "w,": 465, "bo": 466, "sizeof(a)": 467, "sizeof(c)": 468, "w": 469, "a[x][y]": 470, "a[y][x]": 471, "c[x][y]": 472, "c[y][x]": 473, "a[cur][i]": 474, "&&": 475, "c[cur][i]": 476, "vis[cur]": 477, "a[cur][1]": 478, "(a[cur][i]": 479, "(vis[i]": 480, "false)": 481, "a[cur][2]": 482, "c[cur][1]": 483, "%b": 484, "div": 485, "'/'": 486, "2)/div": 487, "divides": 488, "without": 489, "div,": 490, "s[i]": 491, "s[j]": 492, "name": 493, "20": 494, "m[0]": 495, "\"January\"": 496, "m[1]": 497, "\"February\"": 498, "m[2]": 499, "\"March\"": 500, "m[3]": 501, "\"April\"": 502, "m[4]": 503, "\"May\"": 504, "m[5]": 505, "\"June\"": 506, "m[6]": 507, "\"July\"": 508, "m[7]": 509, "\"August\"": 510, "m[8]": 511, "\"September\"": 512, "m[9]": 513, "\"October\"": 514, "m[10]": 515, "\"November\"": 516, "m[11]": 517, "\"December\"": 518, ">>": 519, "move": 520, "it->second": 521, "s.": 522, "m[(j": 523, "12]": 524, "second": 525, "sizeof(G)": 526, "sizeof(G1)": 527, "(max": 528, "fp": 529, "res": 530, "p/2": 531, "casted": 532, "1e9+7": 533, "((": 534, "1e9+7)": 535, "(res": 536, "1e9": 537, "+7))": 538, "2,": 539, "arr": 540, "100005": 541, "arr[i]": 542, "arr[i-1]": 543, "(arr[i": 544, "1]": 545, "arr[i])": 546, "arr[i-1],": 547, "fp(n,": 548, "(1e9": 549, "7)": 550, "((res": 551, "int(1e9": 552, "7))": 553, "7)))": 554, "odd,": 555, "<=": 556, "arr[i": 557, "1],": 558, "p,": 559, "(a": 560, "=integers": 561, "total": 562, "0;": 563, "a[i],": 564, "c[i]": 565, "filled": 566, "v[i]": 567, "v[j]": 568, "c[j]": 569, "4": 570, "5": 571, "6": 572, "7": 573, "8": 574, "9": 575, "10": 576, "11": 577, "12": 578, "d,": 579, "v[i[": 580, "v[i+1]": 581, "current": 582, "v[1]": 583, "(v[i]": 584, "v[i": 585, "1])": 586, "zs": 587, "self": 588, "a[1],": 589, "b[1]": 590, "start,": 591, "b[i],": 592, "b[1],": 593, "120": 594, "2]": 595, "3]": 596, "4]": 597, "5]": 598, "6]": 599, "7]": 600, "8]": 601, "9]": 602, "10]": 603, "11]": 604, "v[z": 605, "n]": 606, "divided": 607, "__gcd(sum,": 608, "getchar": 609, "gtw": 610, "edge": 611, "ada_edge": 612, "no": 613, "ro": 614, "(edge[i][j]": 615, "edge[a][b]": 616, "ada_out_edge": 617, "(edge[a][i]": 618, "edge[a][i]": 619, "edge[i][a]": 620, "variables": 621, "pre": 622, "(b": 623, "(pre": 624, "(pre/d)": 625, "(b/d)": 626, "A": 627, "-2": 628, "g,": 629, "'/',": 630, "asd": 631, "dsa": 632, "dataa": 633, "f,": 634, "f": 635, "itung": 636, "asd[a]": 637, "dsa[s]": 638, "dataa[asd[a]][dsa[s]]": 639, "maps": 640, "z--": 641, "catur": 642, "sb": 643, "catur[i][j]": 644, "(catur[i][j]": 645, "'B')": 646, "lol": 647, "'B',": 648, "vis[i][j]": 649, "graph": 650, "m[1][u]": 651, "graph[u][i]": 652, "m[i][u]": 653, "graph[x][y]": 654, "graph[y][x]": 655, "m[y][x]": 656, "t,": 657, "vis[u]": 658, "graph,": 659, "sizeof(graph)": 660, "sizeof(m)": 661, "3005": 662, "ma": 663, "is_prime": 664, "ma[s]": 665, "ma[\"June\"]": 666, "ma[\"July\"]": 667, "ma[\"August\"]": 668, "ma[\"September\"]": 669, "ma[\"October\"]": 670, "ma[\"November\"]": 671, "ma[\"December\"]": 672, "3,": 673, "4,": 674, "5,": 675, "6,": 676, "7,": 677, "8,": 678, "9,": 679, "10,": 680, "11,": 681, "flag": 682, "s[i][0]": 683, "'B'": 684, "s[i][j]": 685, "s[0][i]": 686, "s[j][i]": 687, "16": 688, "\"8\"": 689, "make_pair(str,": 690, "cost": 691, "GRAPH": 692, "DFS": 693, "vis[x]": 694, "v[x]": 695, "vis[v[x][i]]": 696, "GRAPH[v[x][i]][x]": 697, "v[x][i]": 698, "GRAPH[i][j]": 699, "GRAPH[x][y]": 700, "v[y]": 701, "v[1][0]": 702, "cost1": 703, "cost1=cost": 704, "GRAPH[1][v[1][0]]": 705, "GRAPH[v[1][0]][1]": 706, "GRAPH[v[1][1]][1]": 707, "GRAPH[1][v[1][1]]": 708, "v[1][1]": 709, "cost2": 710, "cost2,": 711, "INF": 712, "0x3f3f3f3f": 713, "exchange": 714, "swap(a,": 715, "defined": 716, "gcd(s,": 717, "inline": 718, "nxt": 719, "_x,": 720, "_tmp": 721, "_x": 722, "_tc": 723, "'0'": 724, "'9'": 725, "'-',": 726, "character,": 727, "'9',": 728, "(_tc": 729, "'0'),": 730, "170": 731, "160": 732, "(i": 733, "==": 734, "\"January\";": 735, "\"February\";": 736, "3)": 737, "\"March\";": 738, "4)": 739, "\"April\";": 740, "5)": 741, "\"May\";": 742, "6)": 743, "\"June\";": 744, "\"July\";": 745, "8)": 746, "\"August\";": 747, "9)": 748, "\"September\";": 749, "10)": 750, "\"October\";": 751, "11)": 752, "\"November\";": 753, "\"December\";": 754, "str,": 755, "s[i+n]": 756, "MAX": 757, "v,": 758, "MAX,": 759, "res,": 760, "v[f]": 761, "g[t]": 762, "g[f]": 763, "v[t]": 764, "arr[i][j]": 765, "gcd(res,": 766, "(A": 767, "(A-2)": 768, "leaves": 769, "n--": 770, "l1": 771, "l2": 772, "concatenated": 773, "l1,": 774, "l1+\"": 775, "\"+l2": 776, "good": 777, "s[o][i]": 778, "'W'": 779, "s[i][o]": 780, "leafName": 781, "lien": 782, "len": 783, "s[len]": 784, "'A'": 785, "'Z'": 786, "'a'": 787, "then": 788, "'z'": 789, "lower": 790, "case": 791, "'e'": 792, "'i'": 793, "'o'": 794, "'u'": 795, "'y'": 796, "\"YES\"": 797, "\"NO\"": 798, "capital": 799, "letter": 800, "board": 801, "board[i]": 802, "row": 803, "\"BBBBBBBB\",": 804, "col": 805, "paint": 806, "board[i][j]": 807, "u,": 808, "maxn,": 809, "index": 810, "u[i]": 811, "u[i],": 812, "v[i],": 813, "u[1],": 814, "v[1],1": 815, "u[1]": 816, "MOD": 817, "mp": 818, "discard": 819, "mp[s]": 820, "mat": 821, "2D": 822, "rows": 823, "columns": 824, "n=integer,": 825, "s=string": 826, "B,": 827, "mat[i][j": 828, "a1,": 829, "a2=integer,": 830, "both": 831, "f1,": 832, "f2=integer,": 833, "mat[j][i]": 834, "mat[i][j]": 835, "a1": 836, "a2": 837, "OR": 838, "do": 839, "following": 840, "ans,val": 841, "1000000007LL": 842, "500005": 843, "mp1": 844, "pair": 845, "integer,": 846, "cycle": 847, "visit[adj[start][i]],": 848, "mp1[create": 849, "a]": 850, "sz": 851, "mp1[": 852, "cycle[i]": 853, "cycle[i+1]": 854, "]": 855, "cycle[sz-1]": 856, "cycle[0]": 857, "cycle[sz": 858, "vol": 859, "'y',": 860, "'Y',": 861, "'o',": 862, "'O',": 863, "'i',": 864, "'I',": 865, "'a',": 866, "'A',": 867, "'e',": 868, "'E',": 869, "'U'": 870, "'?'": 871, "vol[j]": 872, "cout": 873, "<<": 874, "'\\n',": 875, "r,": 876, "200,": 877, "p[0]": 878, "p[1]": 879, "p[2]": 880, "t[0]": 881, "t[1]": 882, "mid": 883, "l[0]": 884, "r[0]": 885, "(r[0]": 886, "l[0])": 887, "l[i]": 888, "r[i]": 889, "(r[i]": 890, "l[i])": 891, "r[i": 892, "p[0],": 893, "p[1],": 894, "p[2],": 895, "ss": 896, "654": 897, "ss[i][j]": 898, "ss[j][i]": 899, "16,": 900, "ss[i]": 901, "sum/2": 902, "p1,": 903, "p2,": 904, "p3,": 905, "t1,": 906, "t2,": 907, "p3": 908, "t1": 909, "t2": 910, "e1,": 911, "e2": 912, "e1": 913, "last": 914, "(l": 915, "last)": 916, "t1)": 917, "statement": 918, "(t1": 919, "t2))": 920, "(r": 921, "l)": 922, "500": 923, "cc": 924, "'z',": 925, "get": 926, "converted": 927, "vowel": 928, "s2,": 929, "s3": 930, "sizeof(k)": 931, "sizeof(x)": 932, "sizeof(y)": 933, "z,": 934, "sizeof(z)": 935, "sizeof(s)": 936, "vis[a[i]]": 937, "vis[b[i]]": 938, "k[t]": 939, "k[i]": 940, "b[j],": 941, "x[v]": 942, "y[v]": 943, "z[v]": 944, "gb1": 945, "gb2": 946, "x[0]": 947, "vis[j]": 948, "x[j]": 949, "y[j]": 950, "z[j]": 951, "excusive,": 952, "B": 953, "ans1+": 954, "cek": 955, "!cek[s],": 956, "cek[s]": 957, "gap": 958, "(gap": 959, "t2)": 960, "<": 961, "{0}": 962, "out[a]": 963, "in[b]": 964, "out[b]": 965, "in[a]": 966, "integers=": 967, "[n": 968, "vow": 969, "\"aeiouy\"": 970, "isalpha(x[i])": 971, "lowercase": 972, "x[i]": 973, "found": 974, "otherwise,": 975, "alphanumeric": 976, "\"NO\",": 977, "(if": 978, "board[j][i]": 979, "&=": 980, "(board[i][j]": 981, "set,": 982, "(board[j][i]": 983, "P1,": 984, "P2,": 985, "P3,": 986, "T1": 987, "T2": 988, "rprev": 989, "tdiff": 990, "tp1,": 991, "tp2": 992, "tp3": 993, "tp1": 994, "skip": 995, "rest": 996, "P1": 997, "P2": 998, "P3": 999, "ch": 1000, "ch[j]": 1001, "\"B\"": 1002, "(i=0": 1003, "exclusive)": 1004, "(j": 1005, "(ch[j]": 1006, "(sum": 1007, "(num,": 1008, "sum)": 1009, "(b[i]": 1010, "a[i])": 1011, "a[i": 1012, "(a[i": 1013, "b[i])": 1014, "ans=0": 1015, "n+1": 1016, "T1,": 1017, ">": 1018, "(d": 1019, "(T1": 1020, "T2))": 1021, "T": 1022, "T1)": 1023, "lasr": 1024, "MAXN": 1025, "1e6": 1026, "res1": 1027, "b[0]": 1028, "used": 1029, "used[0]": 1030, "used[i]": 1031, "(a[i]": 1032, "cur)": 1033, "res2": 1034, "c[0]": 1035, "a[0]": 1036, "used.assign(n,": 1037, "||": 1038, "zero": 1039, "times:": 1040, "keyboard": 1041, "For": 1042, "s:": 1043, "jth": 1044, "If": 1045, "itself": 1046, "smaller": 1047, "plus": 1048, "output": 1049, "b=integers": 1050, "a=0,": 1051, "b=100": 1052, "num=": 1053, "num=0": 1054, "between": 1055, "ans=": 1056, "ans=a+b": 1057, "ans=8": 1058, "40,": 1059, "r0": 1060, "r0,": 1061, "N,": 1062, "path": 1063, "isVisited": 1064, "totAll,": 1065, "totCc": 1066, "totAll": 1067, "path[a][b]": 1068, "now": 1069, "isVisited[1]": 1070, "isVisited[i]": 1071, "path[now][i]": 1072, "path[i][now]": 1073, "h": 1074, "s[0]": 1075, "flag,": 1076, "write": 1077, "ch[i][j]": 1078, "(t": 1079, "(l[i]": 1080, "q": 1081, "consume": 1082, "prer": 1083, "diff": 1084, "(diff": 1085, "_b(8)": 1086, "_b": 1087, "a[q][j]": 1088, "a[i][q]": 1089, "(0),": 1090, "try": 1091, "there": 1092, "nothing": 1093, "otherwise": 1094, "solve": 1095, "e": 1096, "(e": 1097, "method": 1098, "of(": 1099, "e,": 1100, "Chess": 1101, "X": 1102, "Y": 1103, "value,": 1104, "save": 1105, "Chess[0]": 1106, "Chess[i]": 1107, "Chess[i][j]": 1108, "Chess[j][i]": 1109, "X,": 1110, "Y,": 1111, "register": 1112, "min(t1,": 1113, "s)": 1114, "min(l": 1115, "\"5/6\"": 1116, "\"2/3\"": 1117, "\"1/2\"": 1118, "\"1/3\"": 1119, "\"1/6\"": 1120, "\"1/1\"": 1121, "1000,": 1122, "1000": 1123, "r[i-1]": 1124, "(t-t2)*p3": 1125, "sets": 1126, "__gcd(y,": 1127, "min1": 1128, "max1": 1129, "1440": 1130, "k[j]": 1131, "1440,": 1132, "min1,": 1133, "count2": 1134, "c[i][j]": 1135, "count,": 1136, "count2,": 1137, "{0},": 1138, "vocals": 1139, "'u',": 1140, "'Y'": 1141, "contains": 1142, "vocal": 1143, "vocals[i]": 1144, "question": 1145, "counting": 1146, "down": 1147, "question[i]": 1148, "contains(question[i])": 1149, "big": 1150, "six": 1151, "(6": 1152, "big)": 1153, "erad": 1154, "15": 1155, "15,": 1156, "fun": 1157, "a[i][y]": 1158, "s[i][y]": 1159, "b[x][i]": 1160, "s[x][i]": 1161, "fun(i,": 1162, "j)": 1163, "a[i][0]": 1164, "b[i][0]": 1165, "-8": 1166, "UNTYPED": 1167, "a(s[i])": 1168, "\"1/1\\n\"": 1169, "countr": 1170, "until": 1171, "a[j][i]": 1172, "point,": 1173, "num_diff": 1174, "56": 1175, "cmp": 1176, "point[s1]": 1177, "point[s2]": 1178, "num_diff[s1]": 1179, "num_diff[s2]": 1180, "num[s1]": 1181, "num[s2]": 1182, "num1": 1183, "num2": 1184, "name[i]": 1185, "1))": 1186, "num1,": 1187, "substring": 1188, "'-'": 1189, "num2,": 1190, "sort": 1191, "using": 1192, "comparator": 1193, "1000000007": 1194, "M,": 1195, "K,": 1196, "H,": 1197, "W,": 1198, "L": 1199, "R": 1200, "equals": 1201, "\"YES\\n\"": 1202, "\"NO\\n\"": 1203, "L,": 1204, "\"1/6\",": 1205, "\"1/3\",": 1206, "\"1/2\",": 1207, "\"2/3\",": 1208, "\"5/6\",": 1209, "a[6": 1210, "h]": 1211, "{\"1/6\",": 1212, "\"1/1\"}": 1213, "a[6-h]": 1214, "scored,": 1215, "conceed,": 1216, "points": 1217, "vec": 1218, "vectors": 1219, "points[b]": 1220, "points[a]": 1221, "dif1": 1222, "scored[a]": 1223, "conceed[a]": 1224, "dif2": 1225, "scored[b]": 1226, "conceed[b]": 1227, "m--": 1228, "\"\"": 1229, "team1": 1230, "team2": 1231, "st[i]": 1232, "st,": 1233, "sum1": 1234, "':'": 1235, "48": 1236, "(sum1": 1237, "multiply": 1238, "scored[team1]": 1239, "conceed[team2]": 1240, "sum2": 1241, "(sum2": 1242, "scored[team2]": 1243, "conceed[team1]": 1244, "points[team1]": 1245, "points[team2]": 1246, "(t1)": 1247, "(t2)": 1248, "(k": 1249, "1];": 1250, "counter,": 1251, "counter": 1252, "'X'": 1253, "arr[j]": 1254, "k=": 1255, "arr=array": 1256, "intergers": 1257, "arr[i]=1": 1258, "arr[i]=0": 1259, "arr[j],": 1260, "YES": 1261, "NO": 1262, "triangleNumber": 1263, "inegers": 1264, "501": 1265, "precomp": 1266, "triangleNumber[(i": 1267, "indices": 1268, "31": 1269, "triangleNumber[N]": 1270, "T2)": 1271, "Die_Roll": 1272, "Die_Roll[6": 1273, "x]": 1274, "choose": 1275, "den": 1276, "isPrime": 1277, "numzero": 1278, "a[0][0]": 1279, "a[2][2]": 1280, "a[0][1]": 1281, "a[2][1]": 1282, "a[0][2]": 1283, "a[2][0]": 1284, "a[1][0]": 1285, "a[1][2]": 1286, "clock": 1287, "con": 1288, "((en": 1289, "st)": 1290, "p1)": 1291, "(en-st)*p1": 1292, "chance": 1293, "w)": 1294, "pembagi": 1295, "chance,": 1296, "change": 1297, "sqrt(n)": 1298, "signal": 1299, "28": 1300, "double": 1301, "EPS": 1302, "1e-7": 1303, "answer": 1304, "integet": 1305, "a)": 1306, "shift": 1307, "bits": 1308, "left": 1309, "a[2]": 1310, "a[3]": 1311, "a[4],": 1312, "a[5]": 1313, "a[6]": 1314, "a[7],": 1315, "a[8]": 1316, "a[9]": 1317, "a[1]": 1318, "a[7]": 1319, "a[4]": 1320, "1-3": 1321, "9th": 1322, "same": 1323, "8th": 1324, "3rd": 1325, "7th": 1326, "4th": 1327, "6th": 1328, "endline": 1329, "tambah=1": 1330, "for(create": 1331, "i=0": 1332, "500)": 1333, "(i=1": 1334, "i<=500": 1335, "i=i+tambah)": 1336, "tambah": 1337, "if(arr[n]": 1338, "zero)": 1339, "Print": 1340, "ley": 1341, "505": 1342, "increasing": 1343, "arr[n]": 1344, "exists": 1345, "inclusve": 1346, "(minimum": 1347, "(r-l)": 1348, "pt,": 1349, "sc,": 1350, "mi": 1351, "50": 1352, "pt[s1]": 1353, "pt[s2],": 1354, "pt[s2]": 1355, "mi[s1]": 1356, "mi[s2]": 1357, "sc[s1]": 1358, "sc[s2]": 1359, "stdin": 1360, "(n-1)": 1361, "/2": 1362, "A,": 1363, "delimiter": 1364, "pA,": 1365, "pB": 1366, "pA": 1367, "pB,": 1368, "pt[B]": 1369, "pt[A]": 1370, "pt[A],": 1371, "sc[A]": 1372, "mi[A]": 1373, "sc[B]": 1374, "mi[B]": 1375, "compare": 1376, "workTime": 1377, "midTime": 1378, "sleepTime": 1379, "=workTime": 1380, "t1+t2": 1381, "+t1": 1382, "=midTime": 1383, "+t2": 1384, "=sleepTime+": 1385, "prealoc": 1386, "v[n]": 1387, "s[2][j]": 1388, "s[1][0]": 1389, "s[1][2]": 1390, "(r-l)*p1": 1391, "q,": 1392, "\"0/1\\n\"": 1393, "s[2-i][2-j],": 1394, "three": 1395, "times,": 1396, "times": 1397, "i'th": 1398, "minus": 1399, "j'th": 1400, "minutes": 1401, "false.": 1402, "after": 1403, "true:": 1404, "Otherwise...": 1405, "doubles": 1406, "square": 1407, "root": 1408, "a[n-1]": 1409, "a[n": 1410, "{\"\",": 1411, "\"1/1\",": 1412, "\"1/6\"}": 1413, "p[maximum": 1414, "w]": 1415, "\"\",": 1416, "p[max": 1417, "str1,": 1418, "str2,": 1419, "str3,": 1420, "str4": 1421, "str1": 1422, "str2": 1423, "str3": 1424, "flag1": 1425, "str1[0]": 1426, "str3[2]": 1427, "str1[1]": 1428, "str3[1]": 1429, "str1[2]": 1430, "str3[0],": 1431, "str2[0]": 1432, "str2[2]": 1433, "str2[1]": 1434, "str2[0],": 1435, "%=": 1436, "e[i]": 1437, "(p1": 1438, "(e[i]": 1439, "s[i]))": 1440, "diff,": 1441, "e[i": 1442, "(t2": 1443, "p2)": 1444, "((diff": 1445, "p3)": 1446, "(t1+t2)": 1447, "s[i])": 1448, "reverse": 1449, "b[2]": 1450, "\"rock\"": 1451, "\"scissors\"": 1452, "\"M\"": 1453, "\"F\"": 1454, "\"S\"": 1455, "\"paper\"": 1456, "\"?\"": 1457, "\"/6\"": 1458, "minIncl": 1459, "maxExcl": 1460, "(minIncl": 1461, "maxExcl)": 1462, "(mid": 1463, "\"NO\\n\")": 1464, "minIncl,": 1465, "maxExcl,": 1466, "a[l][m]": 1467, "goto": 1468, "jump": 1469, "point": 1470, "label": 1471, "sum=integer": 1472, "sum=0": 1473, "last_time=integer": 1474, "last_time=0": 1475, "begin,": 1476, "end=integers": 1477, "begin": 1478, "interval=integer": 1479, "interval=begin": 1480, "last_time": 1481, "interval": 1482, "sum+t1": 1483, "interval-t1": 1484, "sum+t2": 1485, "interval-t2": 1486, "sum+p3": 1487, "sum+p2": 1488, "sum+p1": 1489, "sum+(end": 1490, "begin)": 1491, "begin-": 1492, "cond": 1493, "max,": 1494, "tri": 1495, "50000": 1496, "tot": 1497, "tri[tot]": 1498, "tri[num]": 1499, "newline,": 1500, "else,": 1501, "line,": 1502, "\"rock\",": 1503, "\"FMS\"": 1504, "win": 1505, "cnt[m[i]]": 1506, "cnt[m[(i": 1507, "3]]": 1508, "m[i]": 1509, "ans[i]": 1510, "s[1]": 1511, "s[2]": 1512, "s[0][0]": 1513, "s[2][2]": 1514, "s[0][1]": 1515, "s[2][1]": 1516, "s[0][2]": 1517, "s[2][0]": 1518, "s[3]": 1519, "s[2][2],": 1520, "s[2][1],": 1521, "s[2][0],": 1522, "s[1][2],": 1523, "gcd_1": 1524, "float": 1525, "(7": 1526, "k)": 1527, "answer,": 1528, "&": 1529, "c[2]": 1530, "c[1]": 1531, "inlined": 1532, "judge": 1533, "x1": 1534, "x2": 1535, "judge(s)": 1536, "judge(s1)": 1537, "judge(s2)": 1538, "\"S\\n\"": 1539, "\"M\\n\"": 1540, "\"F\\n\"": 1541, "\"?\\n\"": 1542, "(i*i": 1543, "two": 1544, "finall": 1545, "one[i]": 1546, "three[res]": 1547, "'.'": 1548, "two[0]": 1549, "two[2]": 1550, "one,": 1551, "check": 1552, "check(a[0],": 1553, "a[1])": 1554, "a[2])": 1555, "check(a[1],": 1556, "a[0])": 1557, "check(a[2],": 1558, "(a[0],": 1559, "(a[1],": 1560, "arguments(a[1],": 1561, "(a[2],": 1562, "a[2],": 1563, "rts": 1564, "order": 1565, ",b": 1566, "ModPow": 1567, "(1ll": 1568, "ModPow(a,": 1569, "m))": 1570, "ModPow((1ll": 1571, "INT_MAX": 1572, "nom": 1573, "dom": 1574, "!(nom": 1575, "!(dom": 1576, "nom,": 1577, "a[2][2],": 1578, "a[2][1],": 1579, "a[2][0],": 1580, "a[1][2],": 1581, "!(cout": 1582, "\"YES\\n\")": 1583, "mx": 1584, "\"5/6\\n\"": 1585, "\"2/3\\n\"": 1586, "\"1/2\\n\"": 1587, "\"1/3\\n\"": 1588, "\"1/6\\n\"": 1589, "\"0/6\\n\"": 1590, "=integer": 1591, "n[0]": 1592, "n[1]": 1593, "n[2]": 1594, "m[2],": 1595, "((i": 1596, "2))": 1597, "2;": 1598, "F,": 1599, "M": 1600, "S": 1601, "D": 1602, "C": 1603, "2005": 1604, "'s'": 1605, "y[0]": 1606, "'p'": 1607, "'r'": 1608, "win(F,": 1609, "M)": 1610, "S)": 1611, "win(M,": 1612, "F)": 1613, "win(S,": 1614, "1e8": 1615, "MN": 1616, "MX": 1617, "-1e9": 1618, "pr": 1619, "(max(n,": 1620, "cnt,": 1621, "long,": 1622, "))": 1623, "spf": 1624, "100001": 1625, "palindrome": 1626, "modexp": 1627, "sieve": 1628, "ceil": 1629, "getFactorization": 1630, "getZarr": 1631, "Z": 1632, "prefix_function": 1633, "pi": 1634, "virus": 1635, "3d": 1636, "dp": 1637, "prefix": 1638, "s[j],": 1639, "pi[j-1]": 1640, "dp[i][j][k]": 1641, "virus,": 1642, "6-x+1": 1643, "num/g": 1644, "den/g": 1645, "s[increment": 1646, "l]": 1647, "s[decrement": 1648, "h],": 1649, "b/2,": 1650, "(temp*temp)": 1651, "(temp": 1652, "spf[1]": 1653, "spf[i]": 1654, "100001,": 1655, "spf[j]": 1656, "ret": 1657, "spf[x]": 1658, "(result": 1659, "R,": 1660, "i=": 1661, "str[R-L]": 1662, "str[R],": 1663, "Z[i]": 1664, "R-L": 1665, "Z[k]": 1666, "initilized": 1667, "pi[i-1]": 1668, "pi[i]": 1669, "mt": 1670, "gc": 1671, "push_back": 1672, "v.begin()": 1673, "\"YES\",": 1674, "gcd,": 1675, "number": 1676, "acos(-1)": 1677, "1000000005": 1678, "dy": 1679, "dx": 1680, "acosign": 1681, "{0,": 1682, "1}": 1683, "{-1,": 1684, "0}": 1685, "(y": 1686, "chacter": 1687, "Do": 1688, "slot": 1689, "Set": 1690, "xth": 1691, "I'th": 1692, "interation": 1693, "A[i]": 1694, "B[x]": 1695, "A[I]": 1696, "B[i]": 1697, "int's": 1698, "fix": 1699, "sqrt(val)": 1700, "(val)": 1701, "winner": 1702, "\"F\",": 1703, "\"M\",": 1704, "\"S\",": 1705, "getwin": 1706, "reference": 1707, "getwin(a,": 1708, "c)": 1709, "winner[0]": 1710, "getwin(b,": 1711, "winner[1]": 1712, "getwin(c,": 1713, "winner[2]": 1714, "winner[3]": 1715, "r2": 1716, "number,": 1717, "ture": 1718, "a[8": 1719, "i]": 1720, "ans[6": 1721, "ans[6-x]": 1722, "pro": 1723, "_gcd": 1724, "\"0/1\"": 1725, "result,": 1726, "h,": 1727, "graph[i]+1": 1728, "graph[i][j]": 1729, "graph[4-i][4-j]": 1730, "4x5": 1731, "put": 1732, "graph[i]": 1733, "graph[4": 1734, "i][4": 1735, "j]": 1736, "person": 1737, "'F',": 1738, "'M',": 1739, "'S'": 1740, "battle": 1741, "wins": 1742, "battle(a,": 1743, "winA,": 1744, "winB,": 1745, "winC,": 1746, "winner,": 1747, "maxWin": 1748, "winCounter": 1749, "winA": 1750, "wins(a,": 1751, "winB": 1752, "wins(b,": 1753, "winC": 1754, "wins(c,": 1755, "(maxWin": 1756, "winA)": 1757, "winB)": 1758, "winC)": 1759, "person[winner]": 1760, "previous": 1761, "infinity": 1762, ";": 1763, "die_roll": 1764, "die_roll[6": 1765, "die_roll[6-x]": 1766, "x[8": 1767, "items": 1768, "code": 1769, "fast": 1770, "file": 1771, "mark": 1772, "17": 1773, "a[2*5-i]": 1774, "a[2": 1775, "111111": 1776, "longs,": 1777, "211111": 1778, "(f": 1779, "(8": 1780, "'\\0'": 1781, "v[i][j]": 1782, "v[2": 1783, "i][2": 1784, "even,": 1785, "const": 1786, "123": 1787, "decimal": 1788, "precision": 1789, "fixed": 1790, "vs(n)": 1791, "vs[i]": 1792, "vs[i][j]": 1793, "vs[i][0]": 1794, "vs[i": 1795, "1][0]": 1796, "\"Time": 1797, "elapsed:": 1798, "\",": 1799, "1.0": 1800, "clock()": 1801, "CLOCKS_PER_SEC": 1802, "s.\\n\"": 1803, "error": 1804, "stream": 1805, "digits": 1806, "vs": 1807, "vs[i-1][0]": 1808, "ticks": 1809, "(q": 1810, "asd[temp]": 1811, "asd[z]": 1812, "x[i][k]": 1813, "x[2": 1814, "k]": 1815, "tmp": 1816, "temp,": 1817, "h1": 1818, "h2": 1819, "1][j]": 1820, "a[i][j": 1821, "data": 1822, "data[i][j]": 1823, "data[0][0]": 1824, "data[2][2]": 1825, "data[0][1]": 1826, "data[2][1]": 1827, "data[0][2]": 1828, "data[2][0]": 1829, "data[1][0]": 1830, "data[1][2]": 1831, "infinite": 1832, "fir": 1833, "excluisve": 1834, "a[i-1][j]": 1835, "a[i][j-1]": 1836, "m[10": 1837, "e[i][j]": 1838, "e[2": 1839, "e[2-1][2-j]": 1840, "ms": 1841, "key": 1842, "ms[f]": 1843, "ms[m]": 1844, "ms[s]": 1845, "disC": 1846, "s2[0]": 1847, "s2[2]": 1848, "s1[c]": 1849, "s3[2": 1850, "c]": 1851, "32": 1852, "valid": 1853, "s[j": 1854, "not,": 1855, "s[j-1]": 1856, "oo": 1857, "_cnt": 1858, "_p": 1859, "file_put": 1860, "open": 1861, "\"filename.in\"": 1862, "reading": 1863, "\"filename.out\"": 1864, "writing": 1865, "st[i][j]": 1866, "st[2": 1867, "w=integer": 1868, "prevc": 1869, "prevr": 1870, "position": 1871, "'YES\"": 1872, "as,": 1873, "bs": 1874, "cs": 1875, "creat": 1876, "W": 1877, "'F'": 1878, "(c": 1879, "'M'": 1880, "|": 1881, "v[i][0]": 1882, "rorate90": 1883, "end[j][N-i-1]": 1884, "start[i][j]": 1885, "areSame": 1886, "end[i][j]": 1887, "start[i][j],": 1888, "resultsquare,": 1889, "newsquare,": 1890, "originalsquare,": 1891, "resultsquare": 1892, "newsquare": 1893, "originalsquare": 1894, "n1": 1895, "originalsquare[i][j]": 1896, "hi": 1897, "rotate90": 1898, "win(f,": 1899, "win(m,": 1900, "f)": 1901, "win(s,": 1902, "s[i": 1903, "s[i][j": 1904, "mxn": 1905, "1.e3": 1906, "tri(n)": 1907, "exit(0)": 1908, "winner(x,": 1909, "z)": 1910, "winner(y,": 1911, "winner(z,": 1912, "flag2": 1913, "c[0][i]": 1914, "c[2][j],": 1915, "flase": 1916, "c[1][0]": 1917, "c[1][2],": 1918, "nan": 1919, "'r',": 1920, "'s',": 1921, "'p',": 1922, "'X',": 1923, "pr,": 1924, "ls": 1925, "nx": 1926, "c[2],": 1927, "c[1],": 1928, "(int)y": 1929, "x[i][j]": 1930, "x[i][j": 1931, "x[i][1]": 1932, "x[i": 1933, "1][1]": 1934, "more": 1935, "x[i][j-1]": 1936, "x[i-1][1]": 1937, "mp[i][j]": 1938, "mp[2": 1939, "mp[i]": 1940, "mp[2-i][2-j]": 1941, "table": 1942, "table[i][j]": 1943, "table[3": 1944, "1][3": 1945, "ch1,": 1946, "ch2": 1947, "ch1": 1948, "cmd": 1949, "people_cnt": 1950, "cmd[0]": 1951, "'+'": 1952, "idx": 1953, "\":\"": 1954, "(length": 1955, "cmd)": 1956, "maxs": 1957, "100+10": 1958, "s[t]": 1959, "':',": 1960, "a[j+1],": 1961, "s[j+1],": 1962, "Q": 1963, "skipping": 1964, "erase": 1965, "Q)": 1966, "starting": 1967, "checker": 1968, "checker(F,": 1969, "checker(S,": 1970, "checker(M,": 1971, "returned": 1972, "ff,": 1973, "1001": 1974, "ch,": 1975, "(integer": 1976, "ith": 1977, "(size": 1978, "modulo": 1979, "getchar()": 1980, "EOF": 1981, "c1": 1982, "integers;": 1983, "d1": 1984, "bool": 1985, "flg": 1986, "st[i][j-1]": 1987, "st[i-1][j]": 1988, "newlines": 1989, "m[s]": 1990, "it->first": 1991, "1000000": 1992, "total,": 1993, "'+',": 1994, "c[t]": 1995, "((length": 1996, "t)": 1997, "Team": 1998, "Win": 1999, "Goals": 2000, "byte": 2001, "ch[0]": 2002, "ch[i]": 2003, "iso": 2004, "chrColor": 2005, "color,": 2006, "perColor": 2007, "perRowColor": 2008, "color": 2009, "perRowColor,": 2010, "perColor,": 2011, "2e5": 2012, "mm": 2013, "mm[s]": 2014, "solve()": 2015, "1001,": 2016, "gesture": 2017, "gesture[\"rock\"]": 2018, "gesture[\"scissors\"]": 2019, "gesture[\"paper\"]": 2020, "gesture[f]": 2021, "gesture[m]": 2022, "gesture[s]": 2023, "active": 2024, "S686": 2025, "M249": 2026, "s[S686]": 2027, "M249(n)": 2028, "ineger": 2029, "s[9]": 2030, "i(0)": 2031, "SIZE": 2032, "M[i]": 2033, "M[i][j]": 2034, "M[i][j": 2035, "i+1": 2036, "M[i+1][j]": 2037, "M[i": 2038, "s[k]": 2039, "commands": 2040, "person,": 2041, "mark_idx,": 2042, "send_size": 2043, "commands[0]": 2044, "mark_idx": 2045, "u[0]": 2046, "\"rrs\"": 2047, "\"ppr\"": 2048, "\"pss\"": 2049, "box": 2050, "^": 2051, "r[1]": 2052, "r[2]": 2053, "box,": 2054, "\"YES\\n\",": 2055, "amount": 2056, "unintialized": 2057, "initialize": 2058, "time": 2059, "sign": 2060, "neither": 2061, "colon": 2062, "followed": 2063, "now,": 2064, "shorts": 2065, "flag[0][0]": 2066, "flag[0][i]": 2067, "flag[0][i-1]": 2068, "flag[i][0]": 2069, "flag[i][j]": 2070, "flag[i][j-1]": 2071, "flag[i-1][j]": 2072, "a[0],": 2073, "\"TRIANGLE\"": 2074, "\"SEGMENT\"": 2075, "\"IMPOSSIBLE\"": 2076, "mmm": 2077, "maxx": 2078, "mmm[a]": 2079, "1e2": 2080, "creatre": 2081, "mygets": 2082, "me,": 2083, "ok,": 2084, "me": 2085, "characterfrom": 2086, "input,": 2087, "\"+\"": 2088, "\"-\"": 2089, "a[j": 2090, "mod": 2091, "100000000": 2092, "ctr,": 2093, "wt": 2094, "v[j],": 2095, "ctr": 2096, "v[wt]": 2097, "swap": 2098, "interchange": 2099, "TRIANGLE": 2100, "SEGMENT": 2101, "IMPOSSIBLE": 2102, "s4": 2103, "V": 2104, "mp[s4]": 2105, "mp[s1]": 2106, "mp[s2]": 2107, "V[i]": 2108, "mp[s3]": 2109, "symbol": 2110, "score1,": 2111, "score2": 2112, "score": 2113, "score1": 2114, "xx": 2115, "xx[0]": 2116, "xx[1]": 2117, "xx[2]": 2118, "xx[3]": 2119, "xx+4": 2120, "ascending": 2121, "b=0": 2122, "yy[b++]": 2123, "xx[j]": 2124, "yy[0]": 2125, "yy[1]": 2126, "yy[2],": 2127, "yy": 2128, "xx[0],": 2129, "xx[1],": 2130, "yy[b]": 2131, "valuef": 2132, "chars": 2133, "gets(s1)": 2134, "s1[0]": 2135, "(s1": 2136, "{}": 2137, "anomalyFound": 2138, "mat[i][0]": 2139, "mat[i-1][0]": 2140, "mat[i+1][0]": 2141, "a[k]": 2142, "fabs": 2143, "a[j]-a[k]": 2144, "\"IMPOSSIBLE\\n\"": 2145, "\"SEGMENT\\n\"": 2146, "\"TRIANGLE\\n\"": 2147, "a=": 2148, "a[k])": 2149, "(int)fabs((a[j]": 2150, "a[k]))),": 2151, "Terminate": 2152, "a[k],": 2153, "terminate": 2154, "olds": 2155, "s+n": 2156, "co": 2157, "s[i+1]": 2158, "c1,": 2159, "c2,": 2160, "c3,": 2161, "c2": 2162, "c3": 2163, "c3)": 2164, "t[1],": 2165, "t[2],": 2166, "t[3]": 2167, "t[i],": 2168, "t[j],": 2169, "t[k]": 2170, "matriz": 2171, "suma": 2172, "aux": 2173, "matriz,": 2174, "matriz[i][j]": 2175, "aux[j]": 2176, "prom": 2177, "pass": 2178, "matriz[i][j+1]": 2179, "matriz[k][0]": 2180, "matriz[k+1][0]": 2181, "f=0,": 2182, "s=0": 2183, "s1=\"": 2184, "t=\"": 2185, "m=\"": 2186, "n(exclusive)": 2187, "if(t==\"": 2188, "\")": 2189, "increament": 2190, "if(s1==t)": 2191, "if(m": 2192, "comando": 2193, "comando[0]": 2194, ",a[1]": 2195, "a+4": 2196, "OR|": 2197, "a[3])": 2198, "s[n/s]": 2199, "n=integer": 2200, "(s,": 2201, "s+n)": 2202, "s[n": 2203, "str[0]": 2204, "ln": 2205, "str[i]": 2206, "(ln": 2207, "TESTS": 2208, "other": 2209, "PI": 2210, "2e9": 2211, "2e9+7": 2212, "'x'": 2213, "n[j]": 2214, "n_participantes,": 2215, "n_bytes,": 2216, "n_participantes=0,": 2217, "n_bytes=0": 2218, "linha_chat": 2219, "linha_chat[0]": 2220, "n_participantes": 2221, "linha_chat[x]": 2222, "n_bytes": 2223, "2000": 2224, "st[0]": 2225, "cnt)": 2226, "m2": 2227, "arr[0]": 2228, "arr[1]": 2229, "arr[2]": 2230, "arr[3]": 2231, "'TRIANGLE\"": 2232, "arr=": 2233, "arr+4": 2234, "(arr[0]": 2235, "arr[2])": 2236, "(arr[1]": 2237, "arr[3])": 2238, "TRUE,": 2239, "index1": 2240, "index2,": 2241, "index2": 2242, "10005": 2243, "inf": 2244, "1e18": 2245, "tc": 2246, "sm": 2247, "mp[st]": 2248, "(sz": 2249, "LastoddPos,": 2250, "LastevenPos,": 2251, "evenCount": 2252, "LastoddPos": 2253, "LastevenPos": 2254, "n[max]": 2255, "n[i]": 2256, "(n[1]": 2257, "n[2])": 2258, "n[3]": 2259, "n[max],": 2260, "gx": 2261, "{1,": 2262, "gy": 2263, "-1}": 2264, "creates": 2265, "last,": 2266, "m[last]": 2267, "m[s2]": 2268, "s[idx-1]": 2269, "getline": 2270, "s[idx": 2271, "((int)s.size()": 2272, "idx)": 2273, "c[i][j+1]": 2274, "c[i+1][j]": 2275, "c[i][j": 2276, "c[i": 2277, "cn1,": 2278, "cn2,": 2279, "cnt1": 2280, "cnt2,": 2281, "cn1": 2282, "cn2": 2283, "s[i][j-1],": 2284, "s[i-1][j],": 2285, "arr[0],": 2286, "arr[1],": 2287, "local": 2288, "s[i],": 2289, "205": 2290, "tp": 2291, "(s": 2292, "local(s)": 2293, "tp(s,": 2294, "vis.count(tp)": 2295, "append": 2296, "strlen(s": 2297, "vis.size()": 2298, "-699999999": 2299, "mainvector": 2300, "mainvector[i]": 2301, "(len": 2302, "tmp1,": 2303, "tmp2": 2304, "tmp3": 2305, "tmp1": 2306, "q[a]": 2307, "zeroes": 2308, "setIt": 2309, "a[i+1]": 2310, "a[i+2]": 2311, "cine": 2312, "e[i][0]": 2313, "e[i][j],": 2314, "e[i+1][0],": 2315, "p[a]": 2316, "copy": 2317, "ar": 2318, "ar[i]": 2319, "fl": 2320, "ar[3]": 2321, "ar[0]": 2322, "ar[1]": 2323, "ar[2]": 2324, "ar[2],": 2325, "ar[1],": 2326, "par,": 2327, "indpar,": 2328, "indimpar,": 2329, "impar,": 2330, "npar": 2331, "nimpar": 2332, "par": 2333, "indpar": 2334, "impar": 2335, "indimpar": 2336, "npar,": 2337, "nimpar,": 2338, "acos(-1.0)": 2339, "mx,": 2340, "mn": 2341, "(1e9),": 2342, "maap": 2343, "maap[s]": 2344, "-1.0": 2345, "1e9,": 2346, "cnt[0]": 2347, "v[i-1]": 2348, "v[i-2]": 2349, "v[i-1]+v[i-2]": 2350, "str[1]": 2351, "'0',": 2352, "isRow": 2353, "(s[i]": 2354, "isRow(s[i])": 2355, "(s[i][0]": 2356, "1][0])": 2357, "empty,": 2358, "s[n/2]": 2359, "pointed": 2360, "command": 2361, "content": 2362, "command[0]": 2363, "id": 2364, "command[i]": 2365, "command.substr(1,": 2366, "command.size()": 2367, "id)": 2368, "last_stripe": 2369, "current_stripe": 2370, "stripe": 2371, "ma,": 2372, "string,": 2373, "lens": 2374, "(lens": 2375, "cnt1,": 2376, "cnt2": 2377, "it's": 2378, "frq": 2379, "count1": 2380, "count1,": 2381, "best": 2382, "v[0]": 2383, "v[2]": 2384, "best=integer,": 2385, "v=": 2386, "kk": 2387, "kkk": 2388, "i-th": 2389, "count;": 2390, "swap(b,": 2391, "swap(c,": 2392, "users": 2393, "traffic": 2394, "v1,": 2395, "v2": 2396, "v1": 2397, "n2": 2398, "=integer,": 2399, "(a[1]": 2400, "(a[0]": 2401, "a[1]=": 2402, "olnum": 2403, "charnum,": 2404, "charsum": 2405, "charnum": 2406, "cOdd,": 2407, "cEven,": 2408, "lOdd": 2409, "lEven,": 2410, "where": 2411, "cOdd": 2412, "cEven": 2413, "lEven": 2414, "2e5+5": 2415, "str.find_first_not_of(str[0],": 2416, "string::npos": 2417, "user": 2418, "indefinitely": 2419, "input[0]": 2420, "inpu[0]": 2421, "coun": 2422, "count_now": 2423, "input[i]": 2424, "cont,": 2425, "aux1,": 2426, "aux2": 2427, "cont": 2428, "aux1": 2429, "sw": 2430, "ingegers": 2431, "a[x]": 2432, "(a[x]": 2433, ",swap(b,": 2434, "ev": 2435, "od": 2436, "contant": 2437, "1000000000": 2438, "'Z',": 2439, "'_',": 2440, "op": 2441, "ccnt,": 2442, "cnt3,": 2443, "ccnt": 2444, "cnt3": 2445, "'@'": 2446, "32,": 2447, "),": 2448, "digit": 2449, "'_'": 2450, "ok(a[i])": 2451, "(cnt2": 2452, "16),": 2453, "(cnt3": 2454, "md": 2455, "100000": 2456, "sumeven,": 2457, "sumodd,": 2458, "sumeven": 2459, "sumodd": 2460, "body": 2461, "FindLen": 2462, "ss[0]": 2463, "FindLen(ss)": 2464, "ss,": 2465, "x[1]": 2466, "x[2]": 2467, "x[3]": 2468, "myCompare": 2469, "address's": 2470, "s[i-1]": 2471, "'.',": 2472, "t--": 2473, "check1": 2474, "check1(s)": 2475, "check(s)": 2476, "underscore": 2477, "un": 2478, "l(s": 2479, "hn": 2480, "nw": 2481, "\".\"": 2482, "un(s)": 2483, "\"@\"": 2484, "un(substring": 2485, "hn(substring": 2486, "r(substring": 2487, "+1)": 2488, "f(s)": 2489, "arr,": 2490, "y1,": 2491, "y2": 2492, "96": 2493, "y1": 2494, "absolute": 2495, "y2,": 2496, "\"R\"": 2497, "\"L\"": 2498, "\"D\"": 2499, "\"U\"": 2500, "(x1": 2501, "x2)": 2502, "(y1": 2503, "y2)": 2504, "U": 2505, "c1[0]": 2506, "c1[1]": 2507, "c2[0]": 2508, "c2[1]": 2509, "\"RU\"": 2510, "\"RD\"": 2511, "\"LD\"": 2512, "\"LU\"": 2513, "c1[1]>": 2514, "(s[0]": 2515, "s1[0])": 2516, "int(s[1]": 2517, "s1[1])": 2518, "-n": 2519, "-m": 2520, "n,m": 2521, "s1[0],": 2522, "s1[1]": 2523, "invert": 2524, "'R'": 2525, "'L'": 2526, "'D'": 2527, "(n)": 2528, "(m)": 2529, "l[1]": 2530, "l[2]": 2531, "l[3]": 2532, "FindLen(string": 2533, "ss)": 2534, "getline(cin,": 2535, "arr[min]": 2536, "ep,": 2537, "ep": 2538, "+(": 2539, "lengh": 2540, "evn": 2541, "goal,": 2542, "way": 2543, "step,": 2544, "tstep": 2545, "goal": 2546, "now[0]": 2547, "goal[0]": 2548, "step": 2549, "now[1]": 2550, "goal[1]": 2551, "way[increment": 2552, "step]": 2553, "-step": 2554, "tstep]": 2555, "way[i]": 2556, "strings.": 2557, "way[tstep]": 2558, "'RD'": 2559, "'LD'": 2560, "'RU'": 2561, "'LU'": 2562, "11111": 2563, "dem": 2564, "oCount": 2565, "eCount": 2566, "txt,": 2567, "txt": 2568, "txt[0]": 2569, "txt[i]": 2570, "mp[name]": 2571, "ind": 2572, "ampty": 2573, "(cnt": 2574, "integer)": 2575, "S[0]": 2576, "49,": 2577, "S[1]": 2578, "97": 2579, "Way": 2580, "sign_X": 2581, "(x2": 2582, "x1)": 2583, "sigh_Y": 2584, "sign_Y": 2585, "(y2": 2586, "y1)": 2587, "sign_Y,": 2588, "49": 2589, "WAY": 2590, "abs(x2": 2591, "abs(y2": 2592, "E": 2593, "O": 2594, "'IMPOSSIBLE\"": 2595, "ns": 2596, "checkDegenerate": 2597, "a[3],": 2598, "a[4])": 2599, "checkDegenerate(a[1],": 2600, "checkDegenerate(a[2],": 2601, "csx": 2602, "ctx": 2603, "sx,": 2604, "sy,": 2605, "tx": 2606, "ty": 2607, "sy": 2608, "sx": 2609, "k-th": 2610, "csx,": 2611, "tx,": 2612, "(substring": 2613, "1st": 2614, "op,": 2615, "xy": 2616, "wtih": 2617, "to,": 2618, "from[0],": 2619, "from[1],": 2620, "to[0],": 2621, "to[1]": 2622, "vec,": 2623, "vec[i]": 2624, "to[0]": 2625, "xy(x1,": 2626, "xy(y1,": 2627, "res(x,": 2628, "bb,": 2629, "bb": 2630, ":,": 2631, "ec": 2632, "oc": 2633, "ec,": 2634, "i*i": 2635, "evenly": 2636, "divisible": 2637, "1000005": 2638, "c(i)": 2639, "g[l": 2640, "c(i),": 2641, "g[i]": 2642, "kol": 2643, "g[i],": 2644, "g[l+1+i]": 2645, "tr": 2646, "((a": 2647, "a))": 2648, "seg": 2649, "b))": 2650, "normal": 2651, "deg": 2652, "(tr(a,": 2653, "c))": 2654, "d))": 2655, "(tr(b,": 2656, "(seg(a,": 2657, "(seg(b,": 2658, "n;": 2659, "b+c": 2660, "arr[x]": 2661, "SZ": 2662, "1003": 2663, "isprime": 2664, "fill": 2665, "isprime,": 2666, "isprime[1]": 2667, "isprime[0]": 2668, "isprime[i]": 2669, "iprime[j]": 2670, "primes": 2671, "primes[i]": 2672, "primes[i": 2673, "isprime[num]": 2674, "constants": 2675, "\"TRIANGLE\\n\",": 2676, "\"SEGMENT\\n\",": 2677, "vec[i": 2678, "1]),": 2679, "even[0]": 2680, "odd[0]": 2681, "1005": 2682, "500,": 2683, "ji": 2684, "prime": 2685, "isPrime[0]": 2686, "isPrime[1]": 2687, "isPrime[i]": 2688, "p[ji]": 2689, "isPrime[j]": 2690, "isPrime[j+1]": 2691, "p[i]": 2692, "p[i+1]": 2693, "isPrime[j": 2694, "p[i": 2695, "ifprime": 2696, "squared": 2697, "3000": 2698, "ifprime(i)": 2699, "good[i": 2700, "good[i]": 2701, "good[i+last+1]": 2702, "1005,": 2703, "prime[1]": 2704, "falst": 2705, "sq": 2706, "1005+0.0": 2707, "prime[j]": 2708, "prime[i]": 2709, "prime[i": 2710, "1e7": 2711, "reopen": 2712, "\"debug.txt\"": 2713, "mode": 2714, "len[0]": 2715, "len[1]": 2716, "len[2]": 2717, "len[3]": 2718, "m]": 2719, "m],": 2720, "f[0]": 2721, "f[1]": 2722, "f[2]": 2723, "f[3]": 2724, "prn": 2725, "pr[i]": 2726, "j*j": 2727, "pr[j]": 2728, "pr[k]": 2729, "next[j]": 2730, "pr[i": 2731, "next[x]": 2732, "10000000000": 2733, "freq": 2734, "freq[temp]": 2735, "++freq[temp]": 2736, "1ll": 2737, "((m": 2738, "primos": 2739, "esPrimo": 2740, "primo": 2741, "esPrimo[i]": 2742, "primos[i": 2743, "primos[i]": 2744, "esPrimo[primos[i": 2745, "n+1,": 2746, "primos[i+1]": 2747, "length,": 2748, "abs(s[0]": 2749, "t[0])": 2750, "abs(s[1]": 2751, "t[1])": 2752, "+1": 2753, "1111": 2754, "plen": 2755, "p[increment": 2756, "plen]": 2757, "p[j]": 2758, "p[j+1]": 2759, "p[plen]": 2760, "incresing": 2761, "p[j": 2762, "round": 2763, "up": 2764, "(a*1.0)": 2765, "1.0)": 2766, "equ": 2767, "|=": 2768, "tri(a,": 2769, "tri(b,": 2770, "\"TRIANGLE\",": 2771, "equ(a,": 2772, "equ(b,": 2773, "\"SEGMENT\",": 2774, "num[0]": 2775, "num[1]": 2776, "num[i]": 2777, "num[j]": 2778, "num[sum]": 2779, "sorty": 2780, "pos": 2781, "x[k]": 2782, "x[pos]": 2783, "y[i]": 2784, "y[pos]": 2785, "2.0))": 2786, "can[i]": 2787, "can[last+i+1]": 2788, "subtract": 2789, "can[last": 2790, "short": 2791, "abs(x": 2792, "abs(y": 2793, "k],": 2794, "m[primes[i]": 2795, "primes[i-1]": 2796, "bitset": 2797, "was": 2798, "100010": 2799, "was[0]": 2800, "was[1]": 2801, "was[i]": 2802, "was[j]": 2803, "bit": 2804, "sieve(n)": 2805, "5000": 2806, "ll": 2807, "4000": 2808, "aa;": 2809, "rr": 2810, "mi,": 2811, "sqrt(a)": 2812, "sizeof(start)": 2813, "end,": 2814, "sizeof(end)": 2815, "start[i]": 2816, "2.0": 2817, "end[i]": 2818, "start[i": 2819, "fase": 2820, "a^2": 2821, "defined,": 2822, "(((a": 2823, "((b": 2824, "looping": 2825, "steps": 2826, "0.5": 2827, "rounded": 2828, "upward": 2829, "upward,": 2830, "d2": 2831, "abs(d1)": 2832, "abs(d2)": 2833, "abs(d1": 2834, "d2)": 2835, "d2,": 2836, "pairs": 2837, "make_pair(x": 2838, "1010": 2839, "visit[i]": 2840, "p[++*p]": 2841, "visit[j]": 2842, "*p": 2843, "visit[t]": 2844, "(s[1]": 2845, "Max;": 2846, "Max": 2847, "cnt]": 2848, "double,": 2849, "(y/2)": 2850, "p[i-1]": 2851, "p[i].first": 2852, "p[i].second": 2853, "1].second": 2854, "coord": 2855, "coord[i],": 2856, "coord[i+1]": 2857, "increments": 2858, "coord[i]": 2859, "coord[i": 2860, "inp": 2861, "inp[0]": 2862, "inp[1]": 2863, "'0';": 2864, "64": 2865, "int;": 2866, "dr": 2867, "d[1]": 2868, "dc": 2869, "res[i]": 2870, "pd": 2871, "find_prime": 2872, "pd[0]": 2873, "pd[1]": 2874, "pd[i]": 2875, "[num]": 2876, "pd[i": 2877, "prime[j]]": 2878, "find": 2879, "r)": 2880, "prime[mid]": 2881, "mz": 2882, "pd[t]": 2883, "find(t)": 2884, "prime[pos": 2885, "prime[pos]": 2886, "prime[MAXN],": 2887, "prime[incremented": 2888, "num]": 2889, "MAXN,": 2890, "pd[i*prime[j]]": 2891, "pos,": 2892, "stones": 2893, "VI,": 2894, "VI2,": 2895, "VI3,": 2896, "VI4": 2897, "abs(a)": 2898, "abs(b)": 2899, "t[0],": 2900, "(square": 2901, "=1": 2902, "tmp,": 2903, "ju": 2904, "ju,": 2905, "{1,1}": 2906, "2002": 2907, "b[p[i]": 2908, "puts": 2909, "pnt": 2910, "t[j": 2911, "judge(x)": 2912, "isp": 2913, "int(c)": 2914, "int(d)": 2915, "\"RU\\n\"": 2916, "\"RD\\n\"": 2917, "\"LU\\n\"": 2918, "\"LD\\n\"": 2919, "\"U\\n\"": 2920, "\"D\\n\"": 2921, "\"R\\n\"": 2922, "\"L\\n\"": 2923, "isprime(i)": 2924, "can(s)": 2925, "v[j": 2926, "abs(x)": 2927, "abs(y)": 2928, "xx,": 2929, "y1-y2": 2930, "\"0\"": 2931, "abs(a": 2932, "abs(b": 2933, "endless": 2934, "d),": 2935, "incremen": 2936, "Primes": 2937, "Primes[i]": 2938, "Primes[0]": 2939, "Primes[1]": 2940, "Primes[i": 2941, "up,": 2942, "m[ss]": 2943, "(s1[0]": 2944, "s2[0])": 2945, "(s1[1]": 2946, "s2[1])": 2947, "s2[1]": 2948, "20000": 2949, "[N": 2950, "fin": 2951, "30000": 2952, "seive": 2953, "f[i]": 2954, "f[j]": 2955, "prevI": 2956, "prime[c]": 2957, "fin,": 2958, "test": 2959, "fin[test]": 2960, "fin[i]": 2961, "fin[i-1]": 2962, "fin[num]": 2963, "prevI,": 2964, "prime[0]": 2965, "f[test],": 2966, "car": 2967, "rean": 2968, "File": 2969, "output.txt": 2970, "input.txt": 2971, "3.1415926": 2972, "1e3": 2973, "arr[j": 2974, "c_x": 2975, "c_y": 2976, "d_y": 2977, "d_x": 2978, "-y": 2979, "c_x,": 2980, "d_y,": 2981, "d_x,": 2982, "((n": 2983, "\"cp.inp\"": 2984, "\"cp.out\"": 2985, "abs(s1[0]": 2986, "abs(s1[1]": 2987, "\"CP.inp\"": 2988, "\"CP.out\"": 2989, "\"w\"": 2990, "stdout": 2991, "s2[1],": 2992, "\"R\",": 2993, "\"L\",": 2994, "\"U\",": 2995, "\"D\",": 2996, "\"1\"": 2997, "a[x": 2998, "abs(s1": 2999, "abs(s2": 3000, "yy,": 3001, "x/a,": 3002, "y/a": 3003, "y[1]": 3004, "cols": 3005, "D,": 3006, "q[0]": 3007, "q[1]": 3008, "\"G\"": 3009, "minimal": 3010, "str2[i]": 3011, "str2[n-i-1]": 3012, "str1[i]": 3013, "str2[n": 3014, "destination": 3015, "udmoves": 3016, "current[1]": 3017, "destination[1]": 3018, "rlmoves": 3019, "current[0]": 3020, "destination[0]": 3021, "abs(udmoves)": 3022, "abs(rlmoves)": 3023, "current,": 3024, "aboslute": 3025, "rlmoves,": 3026, "int(s)": 3027, "int(a)": 3028, "char(int(a)": 3029, "ar[i": 3030, "s]": 3031, "ar[j": 3032, "s],": 3033, "n1,": 3034, "n2,": 3035, "s2)": 3036, "abs(n1": 3037, "n2)": 3038, "1000000,": 3039, "ii": 3040, "jj": 3041, "s[ii]": 3042, "s[jj]": 3043, "sum[k]": 3044, "sum[0]": 3045, "mark[i]": 3046, "mark[j]": 3047, "55,": 3048, "mn,": 3049, "888888,": 3050, "check[i]": 3051, "m1": 3052, "444": 3053, "nextPrime": 3054, "isPrime(ans)": 3055, "noldbach": 3056, "isPrime(i)": 3057, "nextPrimeNum": 3058, "nextPrime(i)": 3059, "noldbach(i)": 3060, "standard": 3061, "temp[j]": 3062, "temp[k]": 3063, "uper,": 3064, "lowar,": 3065, "ck": 3066, "ar[i][j]": 3067, "uper": 3068, "lowar": 3069, "left,": 3070, "'*''": 3071, "\"*\"": 3072, "vec[j": 3073, "vec[q": 3074, "arrar": 3075, "check(i)": 3076, "(good[i]": 3077, "true)": 3078, "!flag": 3079, "2e9,": 3080, "'*',": 3081, "pri": 3082, "168": 3083, "a[temp]": 3084, "pri(i)": 3085, "x[a]": 3086, "x[b]": 3087, "cmp(i,": 3088, "startx,": 3089, "starty,": 3090, "endx,": 3091, "endy": 3092, "startx": 3093, "starty": 3094, "'1'": 3095, "endx": 3096, "starx": 3097, "1000+10,": 3098, "1000+10": 3099, "num[i],": 3100, "prime[increment": 3101, "prime[j": 3102, "*i": 3103, "!num[i]": 3104, "l2,": 3105, "4000,": 3106, "isprime[j]": 3107, "binary_search": 3108, "prime,": 3109, "brr": 3110, "500000": 3111, "priority": 3112, "queue": 3113, "m[p]": 3114, "top": 3115, "d=": 3116, "66": 3117, "6666,": 3118, "dest": 3119, "letter_start": 3120, "letter_start=start[0]": 3121, "letter_dest": 3122, "dest[0]": 3123, "num_start": 3124, "start[1]": 3125, "num_dest": 3126, "dest[1]": 3127, "num_dest,": 3128, "finishx,": 3129, "finishy,": 3130, "startx=55,": 3131, "starty=55": 3132, "finishx": 3133, "finishy": 3134, "1009": 3135, "ok[i": 3136, "incremement": 3137, "v2,": 3138, "b[0],": 3139, "v1+v2-minimum": 3140, "abs(a[0]": 3141, "b[0])": 3142, "abs(a[1]": 3143, "b[1]);": 3144, "i1,": 3145, "i2,": 3146, "abs(i1": 3147, "l1)": 3148, "abs(i2": 3149, "l2)": 3150, "i1": 3151, "i2": 3152, "90": 3153, "hangx": 3154, "4409": 3155, "coty": 3156, "4999": 3157, "tt": 3158, "xaydung": 3159, "hang,": 3160, "cot": 3161, "hang": 3162, "bao1": 3163, "bao2": 3164, "demx": 3165, "demy": 3166, "f[x][col]": 3167, "f[hang][y]": 3168, "coty[0]": 3169, "coty[tt-1]": 3170, "f[i][cot]": 3171, "hangx[0]": 3172, "hangx[tt-1]": 3173, "f[hang][i]": 3174, "f[i][j]": 3175, "hangx[tt]": 3176, "coty[tt]": 3177, "chodoi": 3178, "f[x][cot]": 3179, "coty[tt": 3180, "hangx[tt": 3181, "xaydung(i,": 3182, "prime[i-1]+prime[i-2]+1": 3183, "num[sum],": 3184, "!num[sum]": 3185, "maxx,": 3186, "a[y]": 3187, "decreasing": 3188, "s1[0]-'a'": 3189, "s1[1]-'1'": 3190, "s2[0]-'a'": 3191, "s2[0]-'1'": 3192, "str[count]": 3193, "y1=": 3194, "sievesize": 3195, "bs[0]": 3196, "bs[1]": 3197, "bs[i]": 3198, "bs[j]": 3199, "primes[j]": 3200, "primes[j+1]": 3201, "primes[i],": 3202, "100,": 3203, "-100,": 3204, "-100": 3205, "600,": 3206, "putprime": 3207, "600": 3208, "primes[increment": 3209, "point]": 3210, "isNoldPrime": 3211, "primes[i]*2": 3212, "primes[i+1]": 3213, "primes[point]": 3214, "isprime(x)": 3215, "peimrs[i]": 3216, "<=x": 3217, "isNoldPrime(i)": 3218, "A[i][j]": 3219, "q[i][j]": 3220, "a[ii]": 3221, "a[jj]": 3222, "cx,": 3223, "cy,": 3224, "dx,": 3225, "cy": 3226, "cx": 3227, "xd,yd": 3228, "xd": 3229, "yd": 3230, "abs(xd)": 3231, "abs(yd)": 3232, "a[u]": 3233, "a[s]": 3234, "ii,": 3235, "a[r": 3236, "a[r]": 3237, "s1[0]-s2[0]": 3238, "xmin,": 3239, "xmax,": 3240, "ymin,": 3241, "ymax,": 3242, "xmin": 3243, "xmax": 3244, "ymin": 3245, "ymax": 3246, "sqrt": 3247, "rx": 3248, "ry": 3249, "xf": 3250, "yf": 3251, "1;": 3252, "kol,": 3253, "ans[i],": 3254, "cm": 3255, "lt": 3256, "tp(let": 3257, "has": 3258, "cm(let": 3259, "tp(i)": 3260, "assigned": 3261, "cm(p)": 3262, "YES,": 3263, "flush": 