{"<pad>": 0, "<sos>": 1, "<eos>": 2, "<unk>": 3, "int": 4, "gcd(int": 5, "a,": 6, "b)": 7, "{": 8, "return": 9, "!b": 10, "?": 11, "a": 12, ":": 13, "gcd(b,": 14, "%": 15, "b);": 16, "n,": 17, "nn,": 18, "ans": 19, "=": 20, "0;": 21, "cin": 22, ">>": 23, "n;": 24, "for": 25, "(int": 26, "i": 27, "2;": 28, "<=": 29, "n": 30, "-": 31, "1;": 32, "++i)": 33, "nn": 34, "while": 35, "(nn)": 36, "+=": 37, "i,": 38, "/=": 39, "i;": 40, "o": 41, "gcd(ans,": 42, "2);": 43, "cout": 44, "<<": 45, "/": 46, "\"/\"": 47, "(n": 48, "2)": 49, "\"\\n\";": 50, "string": 51, "b;": 52, "set<string>": 53, "st;": 54, "<": 55, "i++)": 56, "st.insert(a": 57, "+": 58, "\"": 59, "st.size()": 60, "endl;": 61, "m,": 62, "su": 63, "0,": 64, "su2": 65, "b,": 66, "c;": 67, "m": 68, ">": 69, "0)": 70, "m;": 71, "c": 72, "su;": 73, "b": 74, "(su2": 75, "su2;": 76, "gcd1(int": 77, "if": 78, "(a": 79, "==": 80, "gcd1(b": 81, "a);": 82, "long": 83, "modx(long": 84, "base,": 85, "ex)": 86, "1LL,": 87, "val": 88, "base;": 89, "(ex": 90, "0LL)": 91, "&": 92, "1LL)": 93, "(ans": 94, "*": 95, "val)": 96, "1000000009LL;": 97, "(val": 98, "ex": 99, "1LL;": 100, "ans;": 101, "ans1": 102, "ans2": 103, "const": 104, "maxn": 105, "105;": 106, "bool": 107, "visit[maxn];": 108, "vector<int>": 109, "adj[maxn];": 110, "dist[maxn][maxn];": 111, "v;": 112, "void": 113, "dfs(int": 114, "start)": 115, "visit[start]": 116, "true;": 117, "v.push_back(start);": 118, "adj[start].size();": 119, "pt": 120, "adj[start][i];": 121, "(!visit[pt])": 122, "dfs(pt);": 123, "adj[a].push_back(b);": 124, "adj[b].push_back(a);": 125, "dist[b][a]": 126, "dfs(1);": 127, "v.size();": 128, "dist[v[i]][v[(i": 129, "1)": 130, "n]];": 131, "}": 132, "v.size()": 133, ">=": 134, "i--)": 135, "(i": 136, "dist[v[i]][v[v.size()": 137, "1]];": 138, "else": 139, "dist[v[i]][v[i": 140, "min(ans1,": 141, "ans2)": 142, "map<string,": 143, "int>": 144, "int>::iterator": 145, "it;": 146, "getchar();": 147, "str;": 148, "getline(cin,": 149, "str);": 150, "m[str]": 151, "(it": 152, "m.begin();": 153, "it": 154, "!=": 155, "m.end();": 156, "it++)": 157, "ans++;": 158, "k,": 159, "rem,": 160, "sum": 161, "l;": 162, "k": 163, "(k": 164, "rem": 165, "rem;": 166, "l": 167, "__gcd(sum,": 168, "s,": 169, "s1;": 170, "se;": 171, "j,": 172, "k;": 173, "s": 174, "s1,": 175, "'": 176, "',": 177, "se.insert(s);": 178, "se.size()": 179, "s1[110],": 180, "s2[110];": 181, "ans,": 182, "book[110];": 183, "s1[i]": 184, "s2[i];": 185, "ok": 186, "j": 187, "++j)": 188, "j)": 189, "continue;": 190, "(s1[i]": 191, "s1[j]": 192, "&&": 193, "s2[i]": 194, "s2[j])": 195, "(book[j])": 196, "break;": 197, "book[i]": 198, "ok;": 199, "num[105][105];": 200, "vis[105];": 201, "counts;": 202, "en;": 203, "k)": 204, "en": 205, "1": 206, "vis[1]": 207, "return;": 208, "vis[k]": 209, "(vis[i]": 210, "(num[k][i]": 211, "-1)": 212, "(num[i][k]": 213, "counts": 214, "num[i][k];": 215, "dfs(i);": 216, "x,": 217, "y,": 218, "sum;": 219, "(cin": 220, "n)": 221, "memset(num,": 222, "-1,": 223, "sizeof(num));": 224, "memset(vis,": 225, "sizeof(vis));": 226, "x": 227, "y": 228, "num[x][y]": 229, "(num[en][1]": 230, "num[1][en];": 231, "min(counts,": 232, "counts)": 233, "y;": 234, "2": 235, "gcd(long": 236, "(b": 237, "t": 238, "t;": 239, "a;": 240, "ct,": 241, "aa,": 242, "g;": 243, "aa": 244, "ct": 245, "(aa": 246, "ct;": 247, "g": 248, "gcd(s,": 249, "ct);": 250, "fastIo()": 251, "{}": 252, "fastIo();": 253, "char": 254, "MAT[n][m];": 255, "j++)": 256, "MAT[i][j];": 257, "LC": 258, "RC": 259, "TR": 260, "BR": 261, "-1;": 262, "first": 263, "false;": 264, "(MAT[i][j]": 265, "'*')": 266, "(!first)": 267, "min(LC,": 268, "j);": 269, "max(RC,": 270, "min(TR,": 271, "i);": 272, "max(BR,": 273, "TR;": 274, "BR;": 275, "LC;": 276, "RC;": 277, "'\\n';": 278, "c,": 279, "fa[102][102],": 280, "p1,": 281, "p2;": 282, "v[102];": 283, "viy[102][2];": 284, "f1(int": 285, "dg,": 286, "msh)": 287, "(viy[dg][0])": 288, "viy[dg][0]": 289, "(msh": 290, "v[dg][0])": 291, "p1": 292, "fa[v[dg][0]][dg];": 293, "f1(v[dg][0],": 294, "dg);": 295, "fa[v[dg][1]][dg];": 296, "f1(v[dg][1],": 297, "f2(int": 298, "(viy[dg][1])": 299, "viy[dg][1]": 300, "v[dg][1])": 301, "p2": 302, "f2(v[dg][1],": 303, "f2(v[dg][0],": 304, "v[a].push_back(b);": 305, "v[b].push_back(a);": 306, "fa[b][a]": 307, "f1(1,": 308, "0);": 309, "f2(1,": 310, "min(p1,": 311, "p2)": 312, "set1;": 313, "set2;": 314, "map1;": 315, "map2;": 316, "cp[101][101];": 317, "mc1;": 318, "mc2;": 319, "malloc_1(string": 320, "a)": 321, "(set1.count(a)": 322, "map1[a];": 323, "set1.insert(a);": 324, "map1[a]": 325, "mc1++;": 326, "malloc_2(string": 327, "(set2.count(a)": 328, "map2[a];": 329, "set2.insert(a);": 330, "map2[a]": 331, "mc2++;": 332, "cnt": 333, "set1.clear();": 334, "set2.clear();": 335, "mc1": 336, "mc2": 337, "map1.clear();": 338, "memset(cp,": 339, "sizeof(cp));": 340, "map2.clear();": 341, "d;": 342, "malloc_1(a);": 343, "d": 344, "malloc_2(b);": 345, "(cp[c][d]": 346, "cnt++;": 347, "cp[c][d]": 348, "lcm(int": 349, "tem": 350, "tem;": 351, "lcm(b,": 352, "sum,": 353, "su,": 354, "(tem": 355, "re": 356, "lcm(sum,": 357, "s;": 358, "p;": 359, "(n--)": 360, "s);": 361, "p[s]++;": 362, "p.size()": 363, "GCD(int": 364, "y)": 365, "r": 366, "(r": 367, "r;": 368, "u;": 369, "x(0),": 370, "y(m": 371, "n(m),": 372, "z(0);": 373, "z": 374, "z;": 375, "u": 376, "GCD(x,": 377, "y);": 378, "min_i": 379, "51,": 380, "min_j": 381, "max_i,": 382, "max_j;": 383, "a[55][55];": 384, "a[i][j];": 385, "(a[i][j]": 386, "min(min_i,": 387, "min(min_j,": 388, "max_i": 389, "max(max_i,": 390, "max_j": 391, "max(max_j,": 392, "min_i;": 393, "max_i;": 394, "min_j;": 395, "100;": 396, "G[maxn][maxn];": 397, "G1[maxn][maxn];": 398, "vis[maxn];": 399, "num;": 400, "N;": 401, "lsum,": 402, "ssum;": 403, "cur,": 404, "(!vis[i]": 405, "G1[cur][i]": 406, "vis[i]": 407, "(G[cur][i]": 408, "lsum": 409, "G[cur][i];": 410, "dfs(i,": 411, "1);": 412, "N)": 413, "(G[cur][1])": 414, "G[cur][1];": 415, "memset(G,": 416, "sizeof(G));": 417, "memset(G1,": 418, "sizeof(G1));": 419, "num": 420, "ssum": 421, "G[x][y]": 422, "G1[x][y]": 423, "G1[y][x]": 424, "max(num,": 425, "max(x,": 426, "y));": 427, "dfs(1,": 428, "min(lsum,": 429, "lsum)": 430, "(m": 431, "0": 432, "(((m": 433, "n);": 434, "(((n": 435, "m);": 436, "3;": 437, "(map<string,": 438, "++it)": 439, "temp": 440, "(num": 441, "temp;": 442, "__gcd(ans,": 443, "edges[105][105];": 444, "*visited,": 445, "index,": 446, "*ans,": 447, "visited[index]": 448, "(edges[index][i]": 449, "(visited[i]": 450, "*ans": 451, "edges[index][i];": 452, "dfs(visited,": 453, "dfs2(int": 454, "visited[n];": 455, "edges[i][j]": 456, "a--;": 457, "b--;": 458, "edges[a][b]": 459, "edges[b][a]": 460, "visited[i]": 461, "&ans,": 462, "(edges[0][i]": 463, "edges[i][0];": 464, "dfs2(visited,": 465, "&ans2,": 466, "min(ans,": 467, "ans2);": 468, "l,": 469, "((l": 470, "a[105],": 471, "b[105];": 472, "a[i]": 473, "b[i];": 474, "(j": 475, "(a[i]": 476, "a[j]": 477, "b[i]": 478, "b[j])": 479, "ans--;": 480, "prev;": 481, "count": 482, "prev)": 483, "mult": 484, "(prev": 485, "(((prev": 486, "d)": 487, "mult++;": 488, "mult;": 489, "prev": 490, "count++;": 491, "vis[200];": 492, "a[101][101],": 493, "c[101][101];": 494, "x1,": 495, "x2,": 496, "w,": 497, "ans1,": 498, "ans2,": 499, "cur;": 500, "bo;": 501, "memset(a,": 502, "sizeof(a));": 503, "memset(c,": 504, "sizeof(c));": 505, "w;": 506, "a[x][y]": 507, "a[y][x]": 508, "c[x][y]": 509, "c[y][x]": 510, "cur": 511, "(true)": 512, "bo": 513, "false)": 514, "(bo)": 515, "(a[cur][i]": 516, "c[cur][i];": 517, "vis[cur]": 518, "(a[cur][1]": 519, "c[cur][1];": 520, "false,": 521, "((a[cur][i]": 522, "false))": 523, "(a[cur][2]": 524, "add(int": 525, "x)": 526, "x;": 527, "add(n,": 528, "div": 529, "gcd(sum,": 530, "'/'": 531, "s[105];": 532, "s[i]);": 533, "(s[j]": 534, "s[i])": 535, "map<int,": 536, "string>": 537, "string>::iterator": 538, "s[20];": 539, "m[0]": 540, "\"January\";": 541, "m[1]": 542, "\"February\";": 543, "m[2]": 544, "\"March\";": 545, "m[3]": 546, "\"April\";": 547, "m[4]": 548, "\"May\";": 549, "m[5]": 550, "\"June\";": 551, "m[6]": 552, "\"July\";": 553, "m[7]": 554, "\"August\";": 555, "m[8]": 556, "\"September\";": 557, "m[9]": 558, "\"October\";": 559, "m[10]": 560, "\"November\";": 561, "m[11]": 562, "\"December\";": 563, "++j;": 564, "(it->second": 565, "s)": 566, "m[(j": 567, "12]": 568, "fp(long": 569, "p)": 570, "(p": 571, "res": 572, "fp(n,": 573, "p": 574, "int(1e9": 575, "7);": 576, "((res": 577, "7))": 578, "(res": 579, "7)))": 580, "arr[100005],": 581, "arr[i];": 582, "(i)": 583, "(arr[i]": 584, "arr[i": 585, "1])": 586, "(arr[i": 587, "1]": 588, "arr[i])": 589, "arr[i]": 590, "o,": 591, "p,": 592, "base(int": 593, "res;": 594, "base(n,": 595, "__gcd(a,": 596, "a[n],": 597, "b[n],": 598, "c[n],": 599, "total": 600, "c[i];": 601, "v[n": 602, "{0};": 603, "second;": 604, "(!v[i])": 605, "v[i]": 606, "second": 607, "a[i];": 608, "(a[j]": 609, "!v[j])": 610, "j;": 611, "(b[j]": 612, "c[j];": 613, "ans)": 614, "\"January\")": 615, "\"February\")": 616, "\"March\")": 617, "\"April\")": 618, "4;": 619, "\"May\")": 620, "5;": 621, "\"June\")": 622, "6;": 623, "\"July\")": 624, "7;": 625, "\"August\")": 626, "8;": 627, "\"September\")": 628, "9;": 629, "\"October\")": 630, "10;": 631, "\"November\")": 632, "11;": 633, "12;": 634, "d--;": 635, "(d": 636, "3)": 637, "4)": 638, "5)": 639, "6)": 640, "7)": 641, "8)": 642, "9)": 643, "10)": 644, "d,": 645, "v.push_back(a);": 646, "(v[i]": 647, "v[i": 648, "c++;": 649, "((n": 650, "m)": 651, "zs,": 652, "c[105],": 653, "s[i]": 654, "(s[i]": 655, "s[j]": 656, "c[i]": 657, "c[j])": 658, "m++;": 659, "zs++;": 660, "zs": 661, "b[105],": 662, "c[105];": 663, "result": 664, "start,": 665, "self)": 666, "(self": 667, "i)": 668, "(start": 669, "a[i])": 670, "(b[i]": 671, "a[1])": 672, "dfs(b[i],": 673, "b[i])": 674, "dfs(a[i],": 675, "dfs(b[1],": 676, "min(result,": 677, "result);": 678, "vector<string>": 679, "v(120);": 680, "120;": 681, "12)": 682, "2]": 683, "3]": 684, "4]": 685, "5]": 686, "6]": 687, "7]": 688, "8]": 689, "9]": 690, "10]": 691, "11]": 692, "v[z": 693, "n]": 694, "s.insert(m);": 695, "s.size()": 696, "gtw": 697, "edge[100][100];": 698, "ada_edge()": 699, "ro": 700, "or": 701, "(edge[i][j]": 702, "ro;": 703, "edge[a][b]": 704, "(ada_edge())": 705, "ada_out_edge": 706, "(edge[a][i]": 707, "(ada_out_edge)": 708, "edge[a][i]": 709, "(edge[i][a]": 710, "edge[i][a];": 711, "edge[i][a]": 712, "min(gtw,": 713, "gtw)": 714, "o;": 715, "pre": 716, "(long": 717, "pre)": 718, "(pre": 719, "d);": 720, "A;": 721, "(x": 722, "gcd(A": 723, "2,": 724, "(A": 725, "asd;": 726, "dsa;": 727, "dataa[105];": 728, "1,": 729, "f": 730, "itung": 731, "(z--)": 732, "(asd[a]": 733, "asd[a]": 734, "d++;": 735, "(dsa[s]": 736, "dsa[s]": 737, "f;": 738, "f++;": 739, "(dataa[asd[a]][dsa[s]]": 740, "dataa[asd[a]][dsa[s]]++;": 741, "itung++;": 742, "catur[8][8];": 743, "vis[8][8];": 744, "sb": 745, "catur[i][j];": 746, "(catur[i][j]": 747, "'B');": 748, "lol": 749, "8": 750, "catur[i][j]": 751, "'B';": 752, "lol++;": 753, "(lol": 754, "vis[i][j]": 755, "(sb)": 756, "graph[105][105];": 757, "m[105][105];": 758, "u)": 759, "k++;": 760, "vis[u]": 761, "m[1][u];": 762, "(graph[u][i]": 763, "m[i][u];": 764, "memset(graph,": 765, "sizeof(graph));": 766, "memset(m,": 767, "sizeof(m));": 768, "graph[x][y]": 769, "graph[y][x]": 770, "m[y][x]": 771, "(sum": 772, "t)": 773, "num[3005];": 774, "ma;": 775, "is_prime(int": 776, "u);": 777, "ma[s]": 778, "ma[\"June\"]": 779, "ma[\"July\"]": 780, "ma[\"August\"]": 781, "ma[\"September\"]": 782, "ma[\"October\"]": 783, "ma[\"November\"]": 784, "ma[\"December\"]": 785, "12": 786, "ma[s];": 787, "\"January\"": 788, "\"February\"": 789, "\"March\"": 790, "\"April\"": 791, "\"May\"": 792, "\"June\"": 793, "\"July\"": 794, "\"August\"": 795, "\"September\"": 796, "\"October\"": 797, "11)": 798, "\"November\"": 799, "\"December\"": 800, "s[10];": 801, "s[i];": 802, "flag": 803, "(s[i][0]": 804, "'B')": 805, "(s[i][j]": 806, "(f": 807, "(s[0][i]": 808, "(s[j][i]": 809, "(flag": 810, "(cnt": 811, "16)": 812, "\"8\"": 813, "m.insert(make_pair(str,": 814, "1));": 815, "m.size();": 816, "v[101];": 817, "vis[101];": 818, "cost": 819, "GRAPH[101][101];": 820, "DFS(int": 821, "vis[x]": 822, "v[x].size();": 823, "(!vis[v[x][i]])": 824, "(GRAPH[v[x][i]][x]": 825, "GRAPH[v[x][i]][x];": 826, "DFS(v[x][i]);": 827, "GRAPH[i][j]": 828, "GRAPH[x][y]": 829, "v[x].push_back(y);": 830, "v[y].push_back(x);": 831, "DFS(v[1][0]);": 832, "cost1": 833, "cost;": 834, "(GRAPH[1][v[1][0]]": 835, "GRAPH[v[1][0]][1];": 836, "(GRAPH[v[1][1]][1]": 837, "GRAPH[1][v[1][1]];": 838, "DFS(v[1][1]);": 839, "cost2": 840, "(GRAPH[1][v[1][1]]": 841, "GRAPH[v[1][1]][1];": 842, "(GRAPH[v[1][0]][1]": 843, "GRAPH[1][v[1][0]];": 844, "min(cost1,": 845, "cost2)": 846, "INF": 847, "0x3f3f3f3f;": 848, "swap(a,": 849, "(!b)": 850, "inline": 851, "nxt()": 852, "_x": 853, "_tmp": 854, "_tc": 855, "((_tc": 856, "'0'": 857, "||": 858, "'9')": 859, "'-')": 860, "(_tc": 861, "getchar(),": 862, "*=": 863, "10,": 864, "'0'),": 865, "_tmp;": 866, "s[170];": 867, "160;": 868, "str": 869, "str)": 870, "s[i": 871, "MAX": 872, "g[MAX],": 873, "v[MAX];": 874, "f,": 875, "t,": 876, "(v[f]": 877, "g[t])": 878, "g[f]": 879, "v[t]": 880, "v[f]": 881, "g[t]": 882, "min(res,": 883, "res)": 884, "arr[8][8];": 885, "arr[i][j];": 886, "(arr[i][j]": 887, "(count": 888, "a++;": 889, "count;": 890, "b++)": 891, "(t)": 892, "gcd(res,": 893, "A": 894, "leaves;": 895, "l1,": 896, "l2;": 897, "l1": 898, "leaves.insert(l1": 899, "l2);": 900, "leaves.size()": 901, "s[8];": 902, "o++)": 903, "good": 904, "(s[o][i]": 905, "'W')": 906, "good;": 907, "(s[i][o]": 908, "name;": 909, "leafName;": 910, "name);": 911, "leafName.insert(name);": 912, "leafName.size()": 913, "len": 914, "(flag)": 915, "s[len];": 916, "(temp": 917, "'A'": 918, "'Z')": 919, "'a'": 920, "'z')": 921, "len--;": 922, "tolower(x);": 923, "'e'": 924, "'i'": 925, "'o'": 926, "'u'": 927, "'y')": 928, "\"YES\"": 929, "\"NO\"": 930, "board(9);": 931, "board[i];": 932, "row": 933, "(board[i]": 934, "\"BBBBBBBB\")": 935, "++row;": 936, "col": 937, "paint": 938, "(board[i][j]": 939, "(paint)": 940, "++col;": 941, "(row": 942, "col;": 943, "u[maxn],": 944, "v[maxn],": 945, "c[maxn];": 946, "index)": 947, "(index": 948, "(s": 949, "u[i])": 950, "u[1])": 951, "dfs(v[i],": 952, "v[i])": 953, "(u[i]": 954, "dfs(u[i],": 955, "u[i]": 956, "dfs(v[1],": 957, "MOD": 958, "1e9": 959, "mp;": 960, "cin.ignore();": 961, "mp[s]++;": 962, "mp.size()": 963, "mat[9][9];": 964, "mat[i][j": 965, "a1": 966, "a2": 967, "f1": 968, "f2": 969, "mat[j][i];": 970, "mat[i][j];": 971, "f1;": 972, "f2;": 973, "(a1": 974, "1000000007LL;": 975, "adj[500005];": 976, "visit[500005];": 977, "map<pair<int,": 978, "int>,": 979, "mp1;": 980, "cycle;": 981, "cycle.push_back(start);": 982, "(!visit[adj[start][i]])": 983, "dfs(adj[start][i]);": 984, "mp1[make_pair(b,": 985, "a)]": 986, "sz": 987, "cycle.size();": 988, "mp1[make_pair(cycle[i],": 989, "cycle[i": 990, "1])];": 991, "mp1[make_pair(cycle[i": 992, "1],": 993, "cycle[i])];": 994, "mp1[make_pair(cycle[sz": 995, "cycle[0])];": 996, "mp1[make_pair(cycle[0],": 997, "cycle[sz": 998, "vol[]": 999, "{'y',": 1000, "'Y',": 1001, "'o',": 1002, "'O',": 1003, "'i',": 1004, "'I',": 1005, "'a',": 1006, "'A',": 1007, "'e',": 1008, "'E',": 1009, "'u',": 1010, "'U'};": 1011, "'?'": 1012, "')": 1013, "vol[j])": 1014, "'\\n',": 1015, "p[5],": 1016, "t[3],": 1017, "l[200],": 1018, "r[200];": 1019, "p[0]": 1020, "p[1]": 1021, "p[2]": 1022, "t[0]": 1023, "t[1];": 1024, "mid;": 1025, "l[0]": 1026, "r[0];": 1027, "(r[0]": 1028, "l[0])": 1029, "p[0];": 1030, "l[i]": 1031, "r[i];": 1032, "(r[i]": 1033, "l[i])": 1034, "mid": 1035, "r[i": 1036, "1];": 1037, "(mid": 1038, "t[0])": 1039, "-=": 1040, "t[0];": 1041, "t[1])": 1042, "p[1];": 1043, "t[1]": 1044, "p[2];": 1045, "ss[10];": 1046, "ss[i];": 1047, "654;": 1048, "(ss[i][j]": 1049, "temp++;": 1050, "min(temp,": 1051, "(ss[j][i]": 1052, "values;": 1053, "values.insert(a);": 1054, "values.size()": 1055, "p2,": 1056, "p3,": 1057, "t1,": 1058, "t2,": 1059, "r,": 1060, "p3": 1061, "t1": 1062, "t2;": 1063, "e1": 1064, "e2": 1065, "t2": 1066, "e1;": 1067, "last": 1068, "(l": 1069, "t1)": 1070, "last)": 1071, "p1;": 1072, ";": 1073, "(t1": 1074, "t2))": 1075, "p3;": 1076, "l)": 1077, "n--;": 1078, "s[500];": 1079, "gets(s);": 1080, "strlen(s);": 1081, "len;": 1082, "cc": 1083, "tolower(s[i]);": 1084, "(cc": 1085, "cc;": 1086, "(c": 1087, "k[105],": 1088, "x[105],": 1089, "y[105],": 1090, "z[105];": 1091, "s[105][105];": 1092, "s2,": 1093, "s3,": 1094, "memset(k,": 1095, "sizeof(k));": 1096, "memset(x,": 1097, "sizeof(x));": 1098, "memset(y,": 1099, "sizeof(y));": 1100, "memset(z,": 1101, "sizeof(z));": 1102, "memset(s,": 1103, "sizeof(s));": 1104, "vis[a[i]]++;": 1105, "vis[b[i]]--;": 1106, "k[t]": 1107, "t++;": 1108, "(t": 1109, "(k[i]": 1110, "a[j])": 1111, "s1": 1112, "b[j];": 1113, "s3": 1114, "s2": 1115, "a[j];": 1116, "b[j]": 1117, "k[i];": 1118, "c[j]": 1119, "s3;": 1120, "v": 1121, "(c[i]": 1122, "x[v]": 1123, "y[v]": 1124, "z[v]": 1125, "v++;": 1126, "gb1": 1127, "gb2": 1128, "ss": 1129, "x[0];": 1130, "v)": 1131, "(vis[j]": 1132, "((x[j]": 1133, "ss)": 1134, "(y[j]": 1135, "ss))": 1136, "vis[j]": 1137, "y[j];": 1138, "z[j];": 1139, "x[j];": 1140, "min(gb1,": 1141, "gb2)": 1142, "s[20][20];": 1143, "l++;": 1144, "r++;": 1145, "min(l,": 1146, "ans1);": 1147, "min(r,": 1148, "(ans1": 1149, "bool>": 1150, "cek;": 1151, "(!cek[s])": 1152, "cek[s]": 1153, "l[105],": 1154, "r[105];": 1155, "l[i]);": 1156, "gap": 1157, "(gap": 1158, "gap;": 1159, "(0": 1160, "t2)": 1161, "t1);": 1162, "t2);": 1163, "out[n": 1164, "in[n": 1165, "(out[a]": 1166, "in[b])": 1167, "out[b]": 1168, "in[a]": 1169, "out[a]": 1170, "in[b]": 1171, "min(cost": 1172, "sum)": 1173, "vow": 1174, "\"aeiouy\";": 1175, "x);": 1176, "x.length();": 1177, "(isalpha(x[i]))": 1178, "(vow.find(tolower(x[i]))": 1179, "((ok)": 1180, "\"NO\")": 1181, "board[8];": 1182, "B": 1183, "&=": 1184, "++B;": 1185, "(board[j][i]": 1186, "(B": 1187, "P1,": 1188, "P2,": 1189, "P3,": 1190, "T1,": 1191, "T2;": 1192, "P1": 1193, "P2": 1194, "P3": 1195, "T1": 1196, "rprev": 1197, "tdiff": 1198, "tp1": 1199, "tp2": 1200, "tp3": 1201, "(rprev": 1202, "rprev;": 1203, "(tdiff": 1204, "(T1": 1205, "T2))": 1206, "T1;": 1207, "T2);": 1208, "T1)": 1209, "tdiff;": 1210, "ch[100];": 1211, "ch;": 1212, "(ch[j]": 1213, "sum++;": 1214, "min(num,": 1215, "sum);": 1216, "a[n": 1217, "b[n": 1218, "(a[i": 1219, "b[i]);": 1220, "last;": 1221, "T2)": 1222, "T2": 1223, "P1;": 1224, "MAXN": 1225, "1e6;": 1226, "a[MAXN],": 1227, "b[MAXN],": 1228, "c[MAXN];": 1229, "res1": 1230, "b[0];": 1231, "vector<bool>": 1232, "used(n,": 1233, "used[0]": 1234, "t++)": 1235, "(used[i]": 1236, "cur))": 1237, "cur)": 1238, "used[i]": 1239, "res2": 1240, "c[0];": 1241, "a[0];": 1242, "used.assign(n,": 1243, "min(res1,": 1244, "res2)": 1245, "num++;": 1246, "min(b,": 1247, "num);": 1248, "r0,": 1249, "r0": 1250, "r0;": 1251, "N,": 1252, "path[105][105];": 1253, "isVisited[105];": 1254, "totAll,": 1255, "totCc;": 1256, "memset(path,": 1257, "sizeof(path));": 1258, "totAll": 1259, "totCc": 1260, "path[a][b]": 1261, "now": 1262, "isVisited[1]": 1263, "N": 1264, "(not(isVisited[i])": 1265, "and": 1266, "(path[now][i]": 1267, "-1": 1268, "path[i][now]": 1269, "-1))": 1270, "(path[i][now]": 1271, "path[i][now];": 1272, "isVisited[i]": 1273, "min(totCc,": 1274, "totCc)": 1275, "h": 1276, "++h;": 1277, "s[0].size();": 1278, "++l;": 1279, "(h": 1280, "s2;": 1281, "ch[8][8];": 1282, "ch[i][j];": 1283, "(ch[i][j]": 1284, "s++;": 1285, "s1++;": 1286, "(l[i]": 1287, "t1;": 1288, "7,": 1289, "q": 1290, "(z": 1291, "6": 1292, "consume": 1293, "prer": 1294, "(-1": 1295, "prer)": 1296, "diff": 1297, "prer;": 1298, "(diff": 1299, "a[8];": 1300, "(0),": 1301, "_b(8);": 1302, "_b;": 1303, "++q)": 1304, "(a[q][j]": 1305, "++res;": 1306, "(a[i][q]": 1307, "read()": 1308, "(!(cin": 1309, "b))": 1310, "solve()": 1311, "e": 1312, "max(a,": 1313, "gcd(e,": 1314, "(read())": 1315, "solve();": 1316, "Chess[100][100];": 1317, "X,": 1318, "Y;": 1319, "Chess[0])": 1320, "Chess[i];": 1321, "X": 1322, "Y": 1323, "(Chess[i][j]": 1324, "(Chess[j][i]": 1325, "(!X)": 1326, "(!Y)": 1327, "gcd(b": 1328, "a));": 1329, "max(y,": 1330, "w);": 1331, "7": 1332, "gcd(x,": 1333, "6);": 1334, "(register": 1335, "min(t1,": 1336, "min(l": 1337, "\"5/6\"": 1338, "\"2/3\"": 1339, "\"1/2\"": 1340, "\"1/3\"": 1341, "\"1/6\"": 1342, "\"1/1\"": 1343, "l[1000],": 1344, "r[1000];": 1345, "set<int>": 1346, "st[55];": 1347, "s[9],": 1348, "s1[9];": 1349, "__gcd(y,": 1350, "k[1440],": 1351, "min1": 1352, "max1": 1353, "k[j]": 1354, "min1;": 1355, "max1;": 1356, "i++,": 1357, "f++)": 1358, "(k[i])": 1359, "count2;": 1360, "c[10][10];": 1361, "a[10]": 1362, "{0},": 1363, "b[10]": 1364, "c[i][j];": 1365, "count2": 1366, "(c[i][j]": 1367, "a[i]++;": 1368, "count2++;": 1369, "'B'": 1370, "vocals[]": 1371, "{'a',": 1372, "'y',": 1373, "'U',": 1374, "'Y'};": 1375, "contains(char": 1376, "vocal)": 1377, "(vocals[i]": 1378, "question;": 1379, "question);": 1380, "question.size()": 1381, "(question[i]": 1382, "(contains(question[i]))": 1383, "big": 1384, "six": 1385, "(y": 1386, "w)": 1387, "w": 1388, "(6": 1389, "big);": 1390, "do": 1391, "3": 1392, "l[n],": 1393, "r[n];": 1394, "1]);": 1395, "s[15];": 1396, "a[15][15],": 1397, "b[15][15],": 1398, "fun(int": 1399, "(a[i][y]": 1400, "s[i][y]": 1401, "a[i][y]": 1402, "(b[x][i]": 1403, "s[x][i]": 1404, "b[x][i]": 1405, "cnt;": 1406, "fun(i,": 1407, "(a[i][0]": 1408, "b[i][0]": 1409, "a(char": 1410, "c)": 1411, "tolower(c);": 1412, "--i)": 1413, "(a(s[i]))": 1414, "\"1/1\\n\";": 1415, "a[9][9];": 1416, "h[8]": 1417, "countr": 1418, "cin.get(a[i],": 1419, "9,": 1420, "'\\n');": 1421, "cin.ignore(1000,": 1422, "++count;": 1423, "++countr;": 1424, "(countr": 1425, "(a[j][i]": 1426, "point,": 1427, "num_diff,": 1428, "name[56];": 1429, "cmp(string": 1430, "s2)": 1431, "(point[s1]": 1432, "point[s2])": 1433, "point[s1]": 1434, "point[s2];": 1435, "(num_diff[s1]": 1436, "num_diff[s2])": 1437, "num_diff[s1]": 1438, "num_diff[s2];": 1439, "num[s1]": 1440, "num[s2];": 1441, "num1,": 1442, "num2;": 1443, "name[i];": 1444, "1))": 1445, "num1": 1446, "s.substr(0,": 1447, "s.find(\"-\"));": 1448, "s.substr(s.find(\"-\")": 1449, "(num1": 1450, "num2)": 1451, "point[s2]": 1452, "point[s1]++;": 1453, "point[s2]++;": 1454, "num1;": 1455, "num[s2]": 1456, "num_diff[s2]": 1457, "num2": 1458, "sort(name": 1459, "name": 1460, "cmp);": 1461, "name[i]": 1462, "1000000007;": 1463, "M,": 1464, "K,": 1465, "H,": 1466, "W,": 1467, "L,": 1468, "R;": 1469, "\"YES\\n\";": 1470, "\"NO\\n\";": 1471, "a[6]": 1472, "{\"1/6\",": 1473, "\"1/3\",": 1474, "\"1/2\",": 1475, "\"2/3\",": 1476, "\"5/6\",": 1477, "\"1/1\"};": 1478, "a[6": 1479, "h]": 1480, "scored,": 1481, "conceed,": 1482, "points;": 1483, "vec,": 1484, "(points[b]": 1485, "points[a])": 1486, "dif1": 1487, "scored[a]": 1488, "conceed[a];": 1489, "dif2": 1490, "scored[b]": 1491, "conceed[b];": 1492, "(dif1": 1493, "dif2)": 1494, "(scored[a]": 1495, "scored[b])": 1496, "(m--)": 1497, "vec.push_back(st);": 1498, "st": 1499, "\"\";": 1500, "team1": 1501, "\"\",": 1502, "team2": 1503, "st);": 1504, "st.size();": 1505, "(st[i]": 1506, "i++;": 1507, "st[i];": 1508, "(;": 1509, "sum1": 1510, "':')": 1511, "st[i]": 1512, "48;": 1513, "(sum1": 1514, "scored[team1]": 1515, "sum1;": 1516, "conceed[team2]": 1517, "sum2": 1518, "(sum2": 1519, "scored[team2]": 1520, "sum2;": 1521, "conceed[team1]": 1522, "sum2)": 1523, "points[team1]": 1524, "points[team2]": 1525, "points[team1]++;": 1526, "points[team2]++;": 1527, "sort(vec.begin(),": 1528, "vec.end(),": 1529, "vec.size()": 1530, "a.push_back(vec[i]);": 1531, "sort(a.begin(),": 1532, "a.end());": 1533, "a.size();": 1534, "v.push_back(b);": 1535, "(t1)": 1536, "(t2)": 1537, "counter": 1538, "arr[9];": 1539, "'X')": 1540, "j--)": 1541, "arr[j])": 1542, "counter++;": 1543, "(counter": 1544, "triangleNumber[501]": 1545, "{};": 1546, "precomp()": 1547, "32;": 1548, "triangleNumber[(i": 1549, "precomp();": 1550, "(triangleNumber[N])": 1551, "\"YES\";": 1552, "\"NO\";": 1553, "l[1440]": 1554, "r[1440]": 1555, "P2;": 1556, "P3;": 1557, "Die_Roll[6]": 1558, "max(num1,": 1559, "num2);": 1560, "Die_Roll[6": 1561, "x]": 1562, "choose(long": 1563, "den": 1564, "isPrime(int": 1565, "numzero(long": 1566, "a[3][3];": 1567, "(a[0][0]": 1568, "a[2][2])": 1569, "(a[0][1]": 1570, "a[2][1])": 1571, "(a[0][2]": 1572, "a[2][0])": 1573, "(a[1][0]": 1574, "a[1][2])": 1575, "clock": 1576, "con": 1577, "st,": 1578, "(clock;": 1579, "clock++)": 1580, "ct++;": 1581, "(ct": 1582, "((en": 1583, "st)": 1584, "p1);": 1585, "chance": 1586, "gcd": 1587, "__gcd(chance,": 1588, "gcd;": 1589, "pembagi": 1590, "sqrt(n);": 1591, "puts(\"YES\"),": 1592, "exit(0);": 1593, "puts(\"NO\");": 1594, "28;": 1595, "double": 1596, "EPS": 1597, "1e-7;": 1598, "answer": 1599, "(N);": 1600, "(last": 1601, "min(t,": 1602, "T1);": 1603, "a[10];": 1604, "a[1]": 1605, "a[2]": 1606, "a[3];": 1607, "a[4]": 1608, "a[5]": 1609, "a[6];": 1610, "a[7]": 1611, "a[8]": 1612, "a[9];": 1613, "((a[1]": 1614, "a[9])": 1615, "(a[2]": 1616, "a[8])": 1617, "(a[3]": 1618, "a[7])": 1619, "(a[4]": 1620, "a[6]))": 1621, "arr[505];": 1622, "tambah": 1623, "500;": 1624, "tambah)": 1625, "tambah++;": 1626, "(arr[n])": 1627, "pt,": 1628, "sc,": 1629, "mi;": 1630, "name[50];": 1631, "(pt[s1]": 1632, "pt[s2])": 1633, "pt[s1]": 1634, "pt[s2];": 1635, "(mi[s1]": 1636, "mi[s2])": 1637, "mi[s1]": 1638, "mi[s2];": 1639, "sc[s1]": 1640, "sc[s2];": 1641, "A,": 1642, "B;": 1643, "'-');": 1644, "B,": 1645, "');": 1646, "pA,": 1647, "pB;": 1648, "pA": 1649, "ch": 1650, "(pA": 1651, "pB)": 1652, "pt[B]": 1653, "pt[A]": 1654, "pt[A]++,": 1655, "pt[B]++;": 1656, "sc[A]": 1657, "pA;": 1658, "mi[A]": 1659, "sc[B]": 1660, "mi[B]": 1661, "pB": 1662, "sort(name,": 1663, "50;": 1664, "((i": 1665, "(ok)": 1666, "a[105];": 1667, "workTime": 1668, "midTime": 1669, "sleepTime": 1670, "a[i]);": 1671, "v[1000];": 1672, "prealoc()": 1673, "501;": 1674, "prealoc();": 1675, "(v[n])": 1676, "s[5][5];": 1677, "s[i][j];": 1678, "s[2][j])": 1679, "(s[1][0]": 1680, "s[1][2])": 1681, "((a": 1682, "r)": 1683, "\";": 1684, "%=": 1685, "\"0/1\\n\";": 1686, "s[3];": 1687, "s[2": 1688, "i][2": 1689, "j])": 1690, "sqrt(x);": 1691, "x--;": 1692, "(int)x;": 1693, "l[110],": 1694, "r[110];": 1695, "a[200],": 1696, "a[0]": 1697, "p[7]": 1698, "{\"\",": 1699, "\"1/1\",": 1700, "\"1/6\"};": 1701, "p[max(y,": 1702, "w)]": 1703, "str1,": 1704, "str2,": 1705, "str3,": 1706, "str4;": 1707, "str1": 1708, "str2": 1709, "str3;": 1710, "str4": 1711, "str2;": 1712, "flag1": 1713, "((str1[0]": 1714, "str3[2])": 1715, "(str1[1]": 1716, "str3[1])": 1717, "(str1[2]": 1718, "str3[0]))": 1719, "((str2[0]": 1720, "str2[2])": 1721, "(str2[1]": 1722, "str2[1])": 1723, "(str2[2]": 1724, "str2[0]))": 1725, "flag1)": 1726, "map<long": 1727, "long,": 1728, "long>": 1729, "m--;": 1730, "s[n],": 1731, "e[n];": 1732, "e[i];": 1733, "(p1": 1734, "(e[i]": 1735, "s[i]));": 1736, "e[i": 1737, "p1)": 1738, "(t2": 1739, "((diff": 1740, "p3);": 1741, "p2);": 1742, "max(m,": 1743, "reverse(c.begin(),": 1744, "c.end());": 1745, "b[0]": 1746, "b[2])": 1747, "s[105],": 1748, "e[105];": 1749, "e[i]": 1750, "(s2": 1751, "\"rock\"": 1752, "\"scissors\"": 1753, "s3)": 1754, "\"M\"": 1755, "(s1": 1756, "\"F\"": 1757, "(s3": 1758, "s1)": 1759, "\"S\"": 1760, "\"paper\"": 1761, "\"?\"": 1762, "(w": 1763, "max(w,": 1764, "\"/6\"": 1765, "minIncl": 1766, "maxExcl": 1767, "(minIncl": 1768, "maxExcl)": 1769, "\"YES\\n\"": 1770, "\"NO\\n\");": 1771, "r[110],": 1772, "(a[l][m]": 1773, "a[i][j])": 1774, "goto": 1775, "label;": 1776, "label:;": 1777, "last_time": 1778, "begin,": 1779, "end;": 1780, "begin": 1781, "interval": 1782, "last_time;": 1783, "(interval": 1784, "interval;": 1785, "(end": 1786, "begin)": 1787, "cond": 1788, "(cond)": 1789, "max,": 1790, "max": 1791, "tri[50000];": 1792, "num,": 1793, "tot;": 1794, "tot": 1795, "tri[tot]": 1796, "tri[num]": 1797, "endl": 1798, "x[3];": 1799, "{\"rock\",": 1800, "\"scissors\",": 1801, "\"paper\"};": 1802, "\"FMS\";": 1803, "x[i],": 1804, "cnt[x[i]]++;": 1805, "win": 1806, "(cnt[m[i]]": 1807, "cnt[m[(i": 1808, "3]]": 1809, "m[i];": 1810, "(win": 1811, "\"\")": 1812, "(x[i]": 1813, "win)": 1814, "ans[i]": 1815, "s[0];": 1816, "s[1];": 1817, "s[2];": 1818, "(s[0][0]": 1819, "s[2][2])": 1820, "(s[0][1]": 1821, "s[2][1])": 1822, "(s[0][2]": 1823, "s[2][0])": 1824, "(f)": 1825, "gcd_1(int": 1826, "gcd_1(b,": 1827, "float": 1828, "max(n,": 1829, "gcd_1(7": 1830, "(7": 1831, "(double": 1832, "0;;": 1833, "(a[0]": 1834, "c[2]": 1835, "c[1]": 1836, "c[0]": 1837, "judge(string": 1838, "\"rock\")": 1839, "\"scissors\")": 1840, "\"paper\")": 1841, "x2;": 1842, "judge(s);": 1843, "x1": 1844, "judge(s1);": 1845, "x2": 1846, "judge(s2);": 1847, "x1)": 1848, "(x2": 1849, "-2)": 1850, "\"S\\n\";": 1851, "x2)": 1852, "(x1": 1853, "\"M\\n\";": 1854, "\"F\\n\";": 1855, "\"?\\n\";": 1856, "e,": 1857, "g,": 1858, "h,": 1859, "f)": 1860, "puts(\"YES\");": 1861, "one[4];": 1862, "two[4];": 1863, "three[4];": 1864, "finall": 1865, "one": 1866, "two": 1867, "three;": 1868, "(one[i]": 1869, "(three[res]": 1870, "finall++;": 1871, "res--;": 1872, "'.')": 1873, "(two[0]": 1874, "two[2])": 1875, "(finall": 1876, "check(int": 1877, "(check(a[0],": 1878, "check(a[0],": 1879, "a[2]))": 1880, "(check(a[1],": 1881, "a[0])": 1882, "check(a[1],": 1883, "(check(a[2],": 1884, "check(a[2],": 1885, "a[1]))": 1886, "f(int": 1887, "f(n);": 1888, "rts": 1889, "reverse(str.begin(),": 1890, "str.end());": 1891, "(str": 1892, "rts)": 1893, "ModPow(long": 1894, "(!n)": 1895, "(1ll": 1896, "ModPow(a,": 1897, "m))": 1898, "ModPow((1ll": 1899, "INT_MAX;": 1900, "(!(a": 1901, "nom,": 1902, "dom": 1903, "nom": 1904, "(!(nom": 1905, "!(dom": 1906, "2))": 1907, "3))": 1908, "!(cout": 1909, "\"YES\\n\");": 1910, "mx": 1911, "(mx": 1912, "\"5/6\\n\";": 1913, "\"2/3\\n\";": 1914, "\"1/2\\n\";": 1915, "\"1/3\\n\";": 1916, "\"1/6\\n\";": 1917, "\"0/6\\n\";": 1918, "((n[0]": 1919, "s[2])": 1920, "(n[1]": 1921, "s[1])": 1922, "(n[2]": 1923, "s[0])": 1924, "(m[0]": 1925, "m[2]))": 1926, "a[500];": 1927, "F,": 1928, "S;": 1929, "C[2005],": 1930, "D,": 1931, "win(string": 1932, "(x[0]": 1933, "'s'": 1934, "y[0]": 1935, "'p')": 1936, "'p'": 1937, "'r')": 1938, "'r'": 1939, "'s')": 1940, "F": 1941, "M": 1942, "(win(F,": 1943, "M)": 1944, "win(F,": 1945, "S))": 1946, "(win(M,": 1947, "F)": 1948, "win(M,": 1949, "(win(S,": 1950, "win(S,": 1951, "M))": 1952, "1e8": 1953, "MN": 1954, "MX": 1955, "-1e9": 1956, "cnt,": 1957, "MX;": 1958, "pair<long": 1959, "pr;": 1960, "set<long": 1961, "long>::iterator": 1962, "(max(n,": 1963, "\"1/6\";": 1964, "\"1/3\";": 1965, "\"1/2\";": 1966, "\"2/3\";": 1967, "\"5/6\";": 1968, "\"1/1\";": 1969, "spf[100001];": 1970, "palindrome(string": 1971, "modexp(long": 1972, "sieve();": 1973, "ceil(long": 1974, "vector<long": 1975, "getFactorization(long": 1976, "getZarr(string": 1977, "str,": 1978, "Z[]);": 1979, "prefix_function(string": 1980, "pi;": 1981, "virus;": 1982, "dp[105][105][105];": 1983, "prefix(long": 1984, "ch)": 1985, "s[j])": 1986, "pi[j": 1987, "(ch": 1988, "j++;": 1989, "f(long": 1990, "(dp[i][j][k]": 1991, "dp[i][j][k];": 1992, "virus.length())": 1993, "dp[i][j][k]": 1994, "s1.length()": 1995, "s2.length())": 1996, "max(f(i": 1997, "k),": 1998, "f(i,": 1999, "k));": 2000, "prefix(k,": 2001, "virus,": 2002, "s1[i]);": 2003, "f(i": 2004, "max(1": 2005, "a),": 2006, "gcd(num,": 2007, "den);": 2008, "gcd(a": 2009, "gcd(a,": 2010, "s.length()": 2011, "(s[l++]": 2012, "s[h--])": 2013, "modexp(a,": 2014, "temp)": 2015, "sieve()": 2016, "spf[1]": 2017, "100001;": 2018, "spf[i]": 2019, "(spf[i]": 2020, "(spf[j]": 2021, "spf[j]": 2022, "ret;": 2023, "ret.push_back(spf[x]);": 2024, "spf[x];": 2025, "Z[])": 2026, "str.length();": 2027, "R,": 2028, "L": 2029, "R": 2030, "R)": 2031, "(R": 2032, "str[R": 2033, "L]": 2034, "str[R])": 2035, "R++;": 2036, "Z[i]": 2037, "L;": 2038, "R--;": 2039, "(Z[k]": 2040, "Z[k];": 2041, "long)s.length();": 2042, "pi(n);": 2043, "pi[i": 2044, "pi[i]": 2045, "a[3],": 2046, "b[3];": 2047, "reverse(a[2].begin(),": 2048, "a[2].end());": 2049, "reverse(a[1].begin(),": 2050, "a[1].end());": 2051, "b[1])": 2052, "mt;": 2053, "gc": 2054, "gc;": 2055, "v.push_back(0);": 2056, "v.insert(v.begin()": 2057, "\"YES\")": 2058, "number;": 2059, "(number": 2060, "++counter)": 2061, "counter;": 2062, "number)": 2063, "pi": 2064, "acos(-1);": 2065, "1000000005;": 2066, "dy[]": 2067, "{0,": 2068, "1};": 2069, "dx[]": 2070, "{-1,": 2071, "0};": 2072, "A[9],": 2073, "B[9];": 2074, "A[i];": 2075, "B[x]": 2076, "(A[i]": 2077, "B[i])": 2078, "set": 2079, "fix": 2080, "sqrt(val)": 2081, "(fix": 2082, "winner[]": 2083, "{\"F\",": 2084, "\"M\",": 2085, "\"S\",": 2086, "\"?\"};": 2087, "getwin(string": 2088, "&a,": 2089, "&b)": 2090, "(getwin(a,": 2091, "getwin(a,": 2092, "c))": 2093, "winner[0]": 2094, "(getwin(b,": 2095, "getwin(b,": 2096, "winner[1]": 2097, "(getwin(c,": 2098, "getwin(c,": 2099, "winner[2]": 2100, "winner[3]": 2101, "reverse(a.begin(),": 2102, "r2": 2103, "(!(r": 2104, "!(r2": 2105, "a[8": 2106, "i])": 2107, "ans[]": 2108, "ans[6": 2109, "pro": 2110, "B)": 2111, "pro++;": 2112, "__gcd(pro,": 2113, "(pro": 2114, "\"0/1\"": 2115, "100": 2116, "1000": 2117, "(ok": 2118, "true)": 2119, "graph[4][5];": 2120, "graph[i]": 2121, "(graph[i][j]": 2122, "graph[4": 2123, "i][4": 2124, "max)": 2125, "(max": 2126, "person[4]{'F',": 2127, "'M',": 2128, "'S',": 2129, "'?'};": 2130, "battle(const": 2131, "wins(const": 2132, "ret": 2133, "battle(a,": 2134, "c);": 2135, "winA,": 2136, "winB,": 2137, "winC,": 2138, "winner": 2139, "maxWin": 2140, "winCounter": 2141, "winA": 2142, "wins(a,": 2143, "winB": 2144, "wins(b,": 2145, "winC": 2146, "wins(c,": 2147, "winA;": 2148, "(winB": 2149, "winA)": 2150, "winB;": 2151, "(winC": 2152, "winB)": 2153, "winC;": 2154, "(maxWin": 2155, "winC);": 2156, "(winCounter": 2157, "person[winner]": 2158, "previous": 2159, "next": 2160, "2;;": 2161, "next;": 2162, "next)": 2163, "die_roll[6]": 2164, "die_roll[6": 2165, "c[0])": 2166, "(b[0]": 2167, "(c[0]": 2168, "x[9];": 2169, "x[i];": 2170, "x[8": 2171, "fast()": 2172, "file()": 2173, "fast();": 2174, "file();": 2175, "mark": 2176, "a[17];": 2177, "(a[2": 2178, "5": 2179, "i]": 2180, "(mark": 2181, "used[111111];": 2182, "a[211111],": 2183, "((f": 2184, "s))": 2185, "puts(\"?\");": 2186, "puts(\"M\");": 2187, "puts(\"S\");": 2188, "puts(\"F\");": 2189, "(8": 2190, "(int(sqrt(i))": 2191, "int(sqrt(i))": 2192, "v[3][3]": 2193, "{'\\0'};": 2194, "v[i][j];": 2195, "(v[i][j]": 2196, "v[2": 2197, "let(const": 2198, "123;": 2199, "cout.precision(10);": 2200, "fixed;": 2201, "vs(n);": 2202, "(int)(n);": 2203, "vs[i];": 2204, "(int)(m);": 2205, "(vs[i][j]": 2206, "vs[i][0])": 2207, "vs[i][0]": 2208, "vs[i": 2209, "1][0])": 2210, "cerr": 2211, "\"Time": 2212, "elapsed:": 2213, "1.0": 2214, "clock()": 2215, "CLOCKS_PER_SEC": 2216, "s.\\n\";": 2217, "q++)": 2218, "(q": 2219, "asd[temp]++;": 2220, "(asd[z]": 2221, "x[3][3];": 2222, "k++)": 2223, "x[i][k];": 2224, "(x[i][k]": 2225, "x[2": 2226, "k])": 2227, "tmp": 2228, "h1": 2229, "h2": 2230, "a[101][101];": 2231, "a[i": 2232, "1][j])": 2233, "a[i][j": 2234, "data[3][3];": 2235, "data[i][j];": 2236, "(data[0][0]": 2237, "data[2][2])": 2238, "(data[0][1]": 2239, "data[2][1])": 2240, "(data[0][2]": 2241, "data[2][0])": 2242, "(data[1][0]": 2243, "data[1][2])": 2244, "(1)": 2245, "m[10];": 2246, "(m[i]": 2247, "m[10": 2248, "e[3][3];": 2249, "e[i][j];": 2250, "(e[i][j]": 2251, "e[2": 2252, "ms;": 2253, "ms[\"scissors\"]": 2254, "\"paper\";": 2255, "ms[\"paper\"]": 2256, "\"rock\";": 2257, "ms[\"rock\"]": 2258, "\"scissors\";": 2259, "(ms[f]": 2260, "ms[f]": 2261, "(ms[m]": 2262, "ms[m]": 2263, "(ms[s]": 2264, "ms[s]": 2265, "disC": 2266, "(s2[0]": 2267, "s2[2])": 2268, "c++)": 2269, "(s1[c]": 2270, "s3[2": 2271, "c])": 2272, "(!disC)": 2273, "valid": 2274, "s[j": 2275, "(s[0]": 2276, "valid;": 2277, "(valid": 2278, "oo": 2279, "1000;": 2280, "_cnt": 2281, "_p": 2282, "o(long": 2283, "_p;": 2284, "file_put()": 2285, "freopen(\"filename.in\",": 2286, "\"r\",": 2287, "stdin);": 2288, "freopen(\"filename.out\",": 2289, "\"w\",": 2290, "stdout);": 2291, "st[3];": 2292, "st[i]);": 2293, "(st[i][j]": 2294, "st[2": 2295, "prevc": 2296, "prevr": 2297, "'0';": 2298, "(prevr": 2299, "prevr)": 2300, "prevc;": 2301, "v.at(i)": 2302, "(a[1]": 2303, "a[9]": 2304, "a[3]": 2305, "a[6])": 2306, "as,": 2307, "bs,": 2308, "cs;": 2309, "W": 2310, "';": 2311, "as": 2312, "bs": 2313, "e;": 2314, "(as": 2315, "(bs": 2316, "(cs": 2317, "'F';": 2318, "((c": 2319, "'S';": 2320, "((b": 2321, "'M';": 2322, "((d": 2323, "(e": 2324, "|": 2325, "(cout": 2326, "v(n);": 2327, "v[i];": 2328, "(v[i][0]": 2329, "v[i].size();": 2330, "v[i][0])": 2331, "rotate90(int": 2332, "start[10][10],": 2333, "end[10][10])": 2334, "end[j][N": 2335, "start[i][j];": 2336, "areSame(int": 2337, "(end[i][j]": 2338, "start[i][j])": 2339, "resultsquare[10][10],": 2340, "newsquare[10][10],": 2341, "originalsquare[10][10];": 2342, "n1;": 2343, "originalsquare[i][j]": 2344, "hi[10][10];": 2345, "rotate90(3,": 2346, "originalsquare,": 2347, "newsquare);": 2348, "newsquare,": 2349, "hi);": 2350, "(areSame(3,": 2351, "hi))": 2352, "b[0])": 2353, "(win(f,": 2354, "win(f,": 2355, "(win(m,": 2356, "win(m,": 2357, "(win(s,": 2358, "win(s,": 2359, "f))": 2360, "s[101][101];": 2361, "s[i][j": 2362, "mxn": 2363, "1.e3;": 2364, "a[mxn];": 2365, "tri(int": 2366, "((tri(n)": 2367, "\"NO\"))": 2368, "};": 2369, "winner(string": 2370, "z)": 2371, "(winner(x,": 2372, "z))": 2373, "(winner(y,": 2374, "(winner(z,": 2375, "y))": 2376, "**c;": 2377, "true,": 2378, "flag2": 2379, "new": 2380, "*[3];": 2381, "char[3];": 2382, "(c[0][i]": 2383, "c[2][j])": 2384, "j--;": 2385, "(c[1][0]": 2386, "c[1][2])": 2387, "flag2)": 2388, "nan": 2389, "(nan)": 2390, "p++;": 2391, "(c[j]": 2392, "q++;": 2393, "q)": 2394, "pr,": 2395, "ls": 2396, "nx;": 2397, "(nx": 2398, "ls)": 2399, "pr": 2400, "(pr": 2401, "nx)": 2402, "sqrt(8": 2403, "(int)y": 2404, "x[101][101];": 2405, "set<char>": 2406, "x[i][j];": 2407, "(x[i][j]": 2408, "x[i][j": 2409, "s.insert(x[i][j]);": 2410, "(x[i][1]": 2411, "x[i": 2412, "1][1])": 2413, "(s.size()": 2414, "mp[5][5];": 2415, "gets(mp[i]);": 2416, "(mp[i][j]": 2417, "mp[2": 2418, "table;": 2419, "(size_t": 2420, "row;": 2421, "table.push_back(row);": 2422, "(table[i][j]": 2423, "table[3": 2424, "1][3": 2425, "ch1,": 2426, "ch2;": 2427, "ch1;": 2428, "(ch2": 2429, "ch1": 2430, "(ch1": 2431, "ch2)": 2432, "cmd;": 2433, "people_cnt": 2434, "(getline(cin,": 2435, "cmd))": 2436, "(cmd[0]": 2437, "'+')": 2438, "people_cnt++;": 2439, "people_cnt--;": 2440, "idx": 2441, "(cmd[idx]": 2442, "idx++;": 2443, "(int)cmd.substr(idx": 2444, "1).size()": 2445, "people_cnt;": 2446, "cmd": 2447, "maxs": 2448, "s[maxs];": 2449, "(gets(s))": 2450, "k--;": 2451, "(s[t]": 2452, "(strlen(s)": 2453, "s[n];": 2454, "a[j": 2455, "Q;": 2456, "s.substr(1,": 2457, "s.size());": 2458, "Q.insert(ss);": 2459, "Q.erase(ss);": 2460, "s.size();": 2461, "t--;": 2462, "Q.size());": 2463, "checker(string": 2464, "(checker(F,": 2465, "S)": 2466, "(checker(S,": 2467, "(checker(M,": 2468, "ff,": 2469, "v,": 2470, "used[1001];": 2471, "ch,": 2472, "arr[n": 2473, "1][n": 2474, "st.insert(ch);": 2475, "*st.begin();": 2476, "v.push_back(x);": 2477, "(st.size()": 2478, "st.clear();": 2479, "l.insert(s.substr(1));": 2480, "l.erase(s.substr(1));": 2481, "((int)s.size()": 2482, "l.size();": 2483, "EOF)": 2484, "'\\n')": 2485, "++n;": 2486, "--n;": 2487, "++i;": 2488, "c1": 2489, "d1;": 2490, "d1": 2491, "d1)": 2492, "c1++;": 2493, "c1)": 2494, "st[110];": 2495, "flg": 2496, "st[i].size();": 2497, "st[i][j": 2498, "st[i][j]": 2499, "st[i": 2500, "(flg)": 2501, "m.clear();": 2502, "m[s]++;": 2503, "maxn)": 2504, "it->second;": 2505, "it->first;": 2506, "c[1000000];": 2507, "(gets(c": 2508, "(c[1]": 2509, "s--;": 2510, "'+'": 2511, "(c[t]": 2512, "((strlen(c": 2513, "p--;": 2514, "s.find(\":\"));": 2515, "Team,": 2516, "Win;": 2517, "Goals": 2518, "(Goals": 2519, "Team;": 2520, "(Team": 2521, "Win)": 2522, "Goals++;": 2523, "Goals--;": 2524, "Win": 2525, "a[5];": 2526, "ch[105];": 2527, "(gets(ch))": 2528, "byte": 2529, "(ch[0]": 2530, "sum--;": 2531, "strlen(ch);": 2532, "byte++;": 2533, "(ch[i]": 2534, "iso": 2535, "chrColor;": 2536, "color,": 2537, "perColor,": 2538, "perRowColor;": 2539, "color": 2540, "chrColor": 2541, "(color": 2542, "9": 2543, "perColor": 2544, "color)": 2545, "color;": 2546, "perRowColor)": 2547, "perRowColor": 2548, "perColor;": 2549, "(iso": 2550, "2e5": 2551, "a[1001][1001],": 2552, "mm;": 2553, "mm[s]++;": 2554, "mm[s])": 2555, "mm[s];": 2556, "T": 2557, "T;": 2558, "gesture;": 2559, "gesture[\"rock\"]": 2560, "gesture[\"scissors\"]": 2561, "gesture[\"paper\"]": 2562, "(gesture[f]": 2563, "gesture[f]": 2564, "(gesture[m]": 2565, "gesture[m]": 2566, "(gesture[s]": 2567, "gesture[s]": 2568, "active": 2569, "++active;": 2570, "--active;": 2571, "(s.length()": 2572, "tmp;": 2573, "s[j];": 2574, "maxn;": 2575, "answer,": 2576, "S686;": 2577, "M249(int": 2578, "s[S686]++;": 2579, "(maxn": 2580, "s[S686])": 2581, "s[S686];": 2582, "M249(n);": 2583, "q;": 2584, "s.substr(1);": 2585, "q.erase(s);": 2586, "q.insert(s);": 2587, "i(0);": 2588, "(s.size());": 2589, "s.substr(i": 2590, "q.size();": 2591, "SIZE": 2592, "110;": 2593, "M[SIZE];": 2594, "M[i];": 2595, "M[i][j]": 2596, "M[i][j": 2597, "M[i": 2598, "s[k]++;": 2599, "(s[k]": 2600, "s[k];": 2601, "commands;": 2602, "person": 2603, "mark_idx,": 2604, "send_size": 2605, "commands))": 2606, "(commands[0]": 2607, "person++;": 2608, "person--;": 2609, "mark_idx": 2610, "commands.find(':');": 2611, "(commands.size()": 2612, "person;": 2613, "a[110];": 2614, "r.push_back(s[0]);": 2615, "r.push_back(t[0]);": 2616, "r.push_back(u[0]);": 2617, "sort(r.begin(),": 2618, "r.end());": 2619, "\"rrs\"": 2620, "\"ppr\"": 2621, "\"pss\")": 2622, "box": 2623, "r[0]": 2624, "^": 2625, "r[1]": 2626, "r[2];": 2627, "box)": 2628, "(t[0]": 2629, "(u[0]": 2630, "flag;": 2631, "count(s.begin(),": 2632, "s.end(),": 2633, "s[0]);": 2634, "s.size())": 2635, "s[0]": 2636, "v.push_back(s);": 2637, "count(v.begin(),": 2638, "v.end(),": 2639, "'-'": 2640, "now--;": 2641, "now++;": 2642, "s.length();": 2643, "(len": 2644, "now;": 2645, "short": 2646, "flag[100][100];": 2647, "flag[0][0];": 2648, "flag[0][i];": 2649, "(flag[0][i]": 2650, "flag[0][i": 2651, "flag[i][0];": 2652, "flag[i][j];": 2653, "(flag[i][j]": 2654, "flag[i][j": 2655, "flag[i][j]": 2656, "flag[i": 2657, "a[100];": 2658, "a[3])": 2659, "sort(a,": 2660, "4);": 2661, "\"TRIANGLE\"": 2662, "\"SEGMENT\"": 2663, "\"IMPOSSIBLE\"": 2664, "mmm;": 2665, "maxx": 2666, "mmm[a]++;": 2667, "(mmm[a]": 2668, "maxx)": 2669, "mmm[a];": 2670, "c[(int)1e2": 2671, "5];": 2672, "mygets(char": 2673, "*s)": 2674, "getchar())": 2675, "me": 2676, "(gets(c))": 2677, "n++;": 2678, "strlen(c);": 2679, "mod": 2680, "100000000": 2681, "ctr": 2682, "wt;": 2683, "v[j])": 2684, "ctr++;": 2685, "ctr)": 2686, "ctr;": 2687, "wt": 2688, "v[wt]": 2689, "swap(b,": 2690, "swap(c,": 2691, "\"rock\",": 2692, "\"paper\",": 2693, "s4;": 2694, "V;": 2695, "mp[s4]++;": 2696, "V.push_back(s4);": 2697, "(mp[s1]": 2698, "mp[s2]": 2699, "V.size();": 2700, "(V[i]": 2701, "(mp[s3]": 2702, "mp[s1]": 2703, "(mp[s2]": 2704, "mp[s3]": 2705, "s[110];": 2706, "score1,": 2707, "score2;": 2708, "score1++;": 2709, "score2++;": 2710, "(score1": 2711, "score2)": 2712, "(score2": 2713, "score1)": 2714, "s.clear();": 2715, "s.insert(x": 2716, "'0');": 2717, "xx[6];": 2718, "yy[4];": 2719, "xx[0]": 2720, "xx[1]": 2721, "xx[2]": 2722, "xx[3];": 2723, "sort(xx,": 2724, "xx": 2725, "yy[b++]": 2726, "xx[j];": 2727, "(yy[0]": 2728, "yy[1]": 2729, "yy[2])": 2730, "s1[101": 2731, "101": 2732, "101]": 2733, "(gets(s1))": 2734, "(s1[0]": 2735, "(s1[j]": 2736, "(strlen(s1": 2737, "mat[105][105];": 2738, "anomalyFound": 2739, "((mat[i][0]": 2740, "mat[i": 2741, "(mat[i][0]": 2742, "1][0]))": 2743, "(anomalyFound": 2744, "mat[i][j])": 2745, "((a[i]": 2746, "a[k])": 2747, "(int)fabs((a[j]": 2748, "a[k]))))": 2749, "\"IMPOSSIBLE\\n\";": 2750, "\"SEGMENT\\n\";": 2751, "\"TRIANGLE\\n\";": 2752, "olds": 2753, "se.size();": 2754, "sort(s,": 2755, "co": 2756, "co++;": 2757, "(co": 2758, "co;": 2759, "c2": 2760, "c3": 2761, "c1--;": 2762, "c3++;": 2763, "c3)": 2764, "c1;": 2765, "t[4],": 2766, "t[2]": 2767, "t[3]": 2768, "sort(t,": 2769, "t[i],": 2770, "t[j],": 2771, "t[k];": 2772, "matriz[110][110];": 2773, "suma;": 2774, "aux;": 2775, "memset(matriz,": 2776, "sizeof": 2777, "matriz);": 2778, "aux);": 2779, "int(0);": 2780, "int(n);": 2781, "int(m);": 2782, "matriz[i][j]": 2783, "int(aux[j])": 2784, "prom": 2785, "pass": 2786, "suma": 2787, "int(m": 2788, "(matriz[i][j": 2789, "matriz[i][j])": 2790, "(pass)": 2791, "int(n": 2792, "(matriz[k][0]": 2793, "matriz[k": 2794, "comando;": 2795, "comando))": 2796, "(comando[0]": 2797, "x++;": 2798, "((int)comando.size()": 2799, "comando.find(':')": 2800, "a[4];": 2801, "s[102];": 2802, "s[n": 2803, "str))": 2804, "(str[0]": 2805, "cnt--;": 2806, "ln": 2807, "str.size();": 2808, "ln;": 2809, "(str[i]": 2810, "(ln": 2811, "TESTS": 2812, "(TESTS--)": 2813, "a[n];": 2814, "PI": 2815, "2e9": 2816, "(m[s]": 2817, "mx)": 2818, "m[s];": 2819, "'x';": 2820, "start;": 2821, "(n[0]": 2822, "n[0];": 2823, "n[j])": 2824, "n_participantes": 2825, "n_bytes": 2826, "linha_chat;": 2827, "linha_chat)": 2828, "!cin.eof())": 2829, "(linha_chat[0]": 2830, "n_participantes++;": 2831, "n_participantes--;": 2832, "linha_chat.length();": 2833, "x++)": 2834, "(linha_chat[x]": 2835, "linha_chat.length()": 2836, "n_participantes;": 2837, "a[2000];": 2838, "h;": 2839, "st))": 2840, "(st[0]": 2841, "cnt)": 2842, "m2": 2843, "x[n];": 2844, "m2++;": 2845, "m2)": 2846, "arr[4];": 2847, "sort(arr,": 2848, "arr": 2849, "((arr[0]": 2850, "arr[1]": 2851, "arr[2])": 2852, "(arr[1]": 2853, "arr[2]": 2854, "arr[3]))": 2855, "1e2": 2856, "index1,": 2857, "index2;": 2858, "ans1++;": 2859, "index1": 2860, "ans2++;": 2861, "index2": 2862, "10005;": 2863, "inf": 2864, "1e18;": 2865, "z,": 2866, "tc,": 2867, "sm": 2868, "(!mp[st])": 2869, "mp[st]++;": 2870, "(mp[st])": 2871, "mp[st]--;": 2872, "':';": 2873, "sz--;": 2874, "(sz": 2875, "cnt);": 2876, "LastoddPos,": 2877, "LastevenPos,": 2878, "evenCount": 2879, "LastoddPos": 2880, "evenCount--;": 2881, "LastevenPos": 2882, "evenCount++;": 2883, "(evenCount": 2884, "LastevenPos)": 2885, "n[4];": 2886, "n[i];": 2887, "(n[j]": 2888, "n[max])": 2889, "n[max];": 2890, "n[max]": 2891, "n[i]": 2892, "((n[1]": 2893, "n[2])": 2894, "n[0]": 2895, "n[2]": 2896, "n[3]": 2897, "n[1])": 2898, "gx[]": 2899, "{1,": 2900, "gy[]": 2901, "-1};": 2902, "(m[last]": 2903, "m[s2])": 2904, "num--;": 2905, "(s[idx": 2906, "idx);": 2907, "c[a": 2908, "1][b": 2909, "c[i][j": 2910, "c[i": 2911, "cn1,": 2912, "cn2,": 2913, "cn1++;": 2914, "cn2++,": 2915, "(cn1": 2916, "cn2)": 2917, "s[110][110];": 2918, "s[i][j]": 2919, "arr[4],": 2920, "arr[0]": 2921, "arr[3];": 2922, "max(arr[0]": 2923, "arr[2],": 2924, "arr[3]);": 2925, "puts(flag": 2926, "\"SEGMENT\");": 2927, "v.push_back(p);": 2928, "local(char": 2929, "s[])": 2930, "vis;": 2931, "s[205];": 2932, "tp": 2933, "vis.insert(tp);": 2934, "vis.erase(tp);": 2935, "local(s);": 2936, "tp(s,": 2937, "(vis.count(tp))": 2938, "strlen(s": 2939, "vis.size();": 2940, "-699999999;": 2941, "mainvector;": 2942, "even": 2943, "odd": 2944, "mainvector.push_back(a);": 2945, "(mainvector[i]": 2946, "(odd": 2947, "even)": 2948, "(gets(a))": 2949, "strlen(a);": 2950, "tmp1,": 2951, "tmp2,": 2952, "tmp3;": 2953, "tmp2;": 2954, "tmp1": 2955, "tmp2)": 2956, "(tmp2": 2957, "tmp3)": 2958, "index": 2959, "q[a]++;": 2960, "(q[a]": 2961, "q[a];": 2962, "s.find(\":\")": 2963, "y.insert(s[i]);": 2964, "set<string>::iterator": 2965, "setIt": 2966, "y.begin();": 2967, "*setIt)": 2968, "a[0]++;": 2969, "a[1]++;": 2970, "*setIt": 2971, "setIt++;": 2972, "2])": 2973, "s.size()).size();": 2974, "e[n][m];": 2975, "e[i][0];": 2976, "e[i][j])": 2977, "(e[i][0]": 2978, "a[12],": 2979, "b[12];": 2980, "(!p.count(a))": 2981, "p[a]": 2982, "p[a]++;": 2983, "(p[a]": 2984, "p[a];": 2985, "strcpy(b,": 2986, "ar[5];": 2987, "ar[i];": 2988, "sort(ar,": 2989, "ar": 2990, "fl": 2991, "(ar[3]": 2992, "ar[0]": 2993, "ar[1]": 2994, "ar[3]": 2995, "ar[2]": 2996, "ar[2])": 2997, "(ar[2]": 2998, "ar[1])": 2999, "(fl": 3000, "puts(\"TRIANGLE\");": 3001, "puts(\"SEGMENT\");": 3002, "puts(\"IMPOSSIBLE\");": 3003, "par,": 3004, "indpar,": 3005, "indimpar,": 3006, "impar,": 3007, "npar": 3008, "nimpar": 3009, "par": 3010, "npar++;": 3011, "indpar": 3012, "impar": 3013, "nimpar++;": 3014, "indimpar": 3015, "(nimpar": 3016, "(npar": 3017, "acos(-1.0);": 3018, "int(1e9);": 3019, "mx,": 3020, "mn;": 3021, "mn": 3022, "(1e9),": 3023, "maap;": 3024, "maap[s]++;": 3025, "(maap[s]": 3026, "maap[s];": 3027, "count--;": 3028, "z++;": 3029, "cnt[2];": 3030, "cnt[0]++;": 3031, "s[1]": 3032, "(cnt[0]": 3033, "cnt[0])": 3034, "v(4);": 3035, "sort(v.begin(),": 3036, "v.end());": 3037, "str[10005];": 3038, "(gets(str))": 3039, "strlen(str);": 3040, "str[1]": 3041, "'0')": 3042, "s[100];": 3043, "isRow(string": 3044, "result;": 3045, "isRow(s[i]);": 3046, "1][0]);": 3047, "*a": 3048, "int[n];": 3049, "f1++;": 3050, "command;": 3051, "name.clear();": 3052, "command))": 3053, "(command[0]": 3054, "name.insert(command.substr(1,": 3055, "command.size()": 3056, "name.erase(command.substr(1,": 3057, "id": 3058, "command.length();": 3059, "(command[i]": 3060, "name.size()": 3061, "(command.length()": 3062, "id);": 3063, "(arr[3]": 3064, "arr[0])": 3065, "last_stripe": 3066, "ok)": 3067, 